{"last_updated": "March 06, 2019", "services": [{"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/linux/", "name": "Linux Virtual Machines", "abstract": "\nAzure Linux Virtual Machines provides on-demand, high-scale, secure, virtualized infrastructure using Red Hat, Ubuntu, or the Linux distribution of your choice. Learn how to create, configure, manage, update, and scale Linux VMs with our quickstarts, tutorials, and samples.\n"}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/", "name": "Windows Virtual Machines", "abstract": "\nAzure Windows Virtual Machines provides on-demand, high-scale, secure, virtualized infrastructure using Windows Server. Learn how to create, configure, manage, and scale Windows VMs with our quickstarts, tutorials, and samples.\n"}, {"category": ["Compute", "Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service/", "name": "App Service", "abstract": "\nAzure App Service enables you to build and host web apps, mobile back ends, and RESTful APIs in the programming language of your choice without managing infrastructure. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. Learn how to use Azure App Service with our quickstarts, tutorials, and samples.\n"}, {"category": ["Compute", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-functions/", "name": "Functions", "abstract": "\nAzure Functions is a serverless compute service that enables you to run code on-demand without having to explicitly provision or manage infrastructure. Use Azure Functions to run a script or piece of code in response to a variety of events. Learn how to use Azure Functions with our quickstarts, tutorials, and samples.\n"}, {"category": ["Compute", "Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/batch/", "name": "Batch", "abstract": "\nUse Batch to run large-scale parallel and high-performance computing (HPC) applications efficiently in the cloud. Define the Azure compute resources to execute your applications in parallel or at scale without manually configuring or managing infrastructure. Schedule compute-intensive tasks and dynamically add or remove compute resources based on your requirements. Learn how to use Azure Batch with our quickstarts, tutorials, and samples.\n"}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/container-instances/", "name": "Azure Container Instances", "abstract": "\nAzure Container Instances offers the fastest and simplest way to run a container in Azure, without having to provision any virtual machines and without having to adopt a higher-level service. Learn how to create and manage container instances with our quickstarts, tutorials, and samples.If you require a complete container orchestration solution, see the Azure Kubernetes Service (AKS) documentation.\n"}, {"category": ["Compute", "Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/service-fabric/", "name": "Service Fabric", "abstract": "\nAzure Service Fabric is a distributed systems platform that makes it easy to package, deploy, and manage scalable and reliable microservices and containers. Developers and administrators can avoid complex infrastructure problems and focus on implementing mission-critical, demanding workloads that are scalable, reliable, and manageable. Learn how to use Azure Service Fabric with our quickstarts, tutorials, and samples.\n"}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/", "name": "Virtual Machine Scale Sets", "abstract": "\nAzure virtual machine scale sets let you create and manage a group of identical, load balanced, and autoscaling VMs. Learn how to create, configure, manage, and autoscale virtual machine scale sets with our quickstarts, tutorials, and samples.\n"}, {"category": ["Compute", "Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/aks/", "name": "Azure Kubernetes Service (AKS)", "abstract": "\nAzure Kubernetes Service (AKS) manages your hosted Kubernetes environment, making it quick and easy to deploy and manage containerized applications without container orchestration expertise. It also eliminates the burden of ongoing operations and maintenance by provisioning, upgrading, and scaling resources on demand, without taking your applications offline.\n"}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/cloud-services/", "name": "Cloud Services", "abstract": "Learn how to use Cloud Services to host and run highly available, scalable cloud applications and APIs.  Tutorials, API references and other documentation show you how to manage virtual machine hosts and configure, patch, and install software."}, {"category": ["Compute", "Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/sql/virtual-machines-windows-sql-server-iaas-overview?toc=%2Fazure%2Fvirtual-machines%2Fwindows%2Ftoc.json", "name": "SQL Server on Virtual Machines", "abstract": "SQL Server on Azure virtual machines enables you to use full versions of SQL Server in the Cloud without having to manage any on-premises hardware. SQL Server VMs also simplify licensing costs when you pay as you go."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/workloads/sap/hana-overview-architecture", "name": "SAP HANA on Azure Large Instances", "abstract": "SAP HANA on Azure (Large Instances) is a unique solution to Azure. In addition to providing virtual machines for deploying and running SAP HANA, Azure offers you the possibility to run and deploy SAP HANA on bare-metal servers that are dedicated to you. The SAP HANA on Azure (Large Instances) solution builds on non-shared host/server bare-metal hardware that is assigned to you. The server hardware is embedded in larger stamps that contain compute/server, networking, and storage infrastructure. As a combination, it's HANA tailored data center integration (TDI) certified. SAP HANA on Azure (Large Instances) offers different server SKUs or sizes. Units can have 36 Intel CPU cores and 768 GB of memory and go up to units that have up to 480 Intel CPU cores and up to 24 TB of memory."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/cyclecloud/", "name": "CycleCloud", "abstract": "\nAzure CycleCloud is designed to enable enterprise IT organizations to provide secure and flexible cloud HPC and Big Compute environments to their end users. With dynamic scaling of clusters, the business can get the resources it needs at the right time and the right price. Azure CycleCloud’s automated configuration enables IT to focus on providing service to the business users.\n"}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/sql-database/", "name": "Azure SQL Database", "abstract": "\nAzure SQL Database is a general-purpose relational database-as-a-service (DBaaS) based on the latest stable version of Microsoft SQL Server Database Engine. SQL Database is a high-performance, reliable, and secure cloud database that you can use to build data-driven applications and websites in the programming language of your choice, without needing to manage infrastructure. Learn how to use SQL Database with our quickstarts, tutorials, and samples.\n"}, {"category": ["Databases", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/cosmos-db/", "name": "Azure Cosmos DB", "abstract": "\nAzure Cosmos DB is a globally distributed, multi-model database service that supports document, key-value, wide-column, and graph databases. Learn how to use Azure Cosmos DB with our quickstarts, tutorials, and samples.\n"}, {"category": ["Databases", "Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/sql-data-warehouse/", "name": "SQL Data Warehouse", "abstract": "Learn how to use an Azure SQL Data Warehouse, which combines SQL relational databases with massively parallel processing. Tutorials and other documentation shows you how to design, load, manage, and analyze data using a data warehouse. "}, {"category": ["Databases", "Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-factory/", "name": "Data Factory", "abstract": "\nLearn how to use Data Factory, a cloud data integration service, to compose data storage, movement, and processing services into automated data pipelines. Tutorials and other documentation show you how to set up and manage data pipelines, and how to move and transform data for analysis. If you are using V1 of the Data Factory service, see V1 documentation.\n"}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-cache-for-redis/", "name": "Azure Cache for Redis", "abstract": "Learn how to use Azure Cache for Redis, a secure data cache and messaging broker that provides high throughput and low-latency access to data for applications. Tutorials, API references, and other documentation show you how to use Azure Cache for Redis from any application on Azure."}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/sql-server-stretch-database/", "name": "SQL Server Stretch Database", "abstract": "Learn how to use SQL Server Stretch Database to migrate cold data transparently and securely to the Azure cloud. Tutorials and other documentation help you set up cost-effective availability for databases with infrequently used data without requiring changes to existing queries or applications."}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/cosmos-db/table-storage-overview", "name": "Table Storage", "abstract": "Azure Table storage is a service that stores structured NoSQL data in the cloud, providing a key/attribute store with a schemaless design. Because Table storage is schemaless, it's easy to adapt your data as the needs of your application evolve. Access to Table storage data is fast and cost-effective for many types of applications, and is typically lower in cost than traditional SQL for similar volumes of data."}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/postgresql/", "name": "Azure Database for PostgreSQL", "abstract": "\nAzure Database for PostgreSQL is a relational database service based on the open-source Postgres database engine.  It's a fully managed database as a service offering that can handle mission-critical workloads with predictable performance, security, high availability, and dynamic scalability.  Develop applications with Azure Database for PostgreSQL leveraging the open-source tools and platform of your choice.  Learn how to use Azure Database for PostgreSQL with our quickstarts, tutorials, and samples.\n"}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/mysql/", "name": "Azure Database for MySQL", "abstract": "\nAzure Database for MySQL is a relational database service based on the open-source MySQL Server engine.  It's a fully managed database as a service offering that can handle mission-critical workloads with predictable performance and dynamic scalability. Develop applications with Azure Database for MySQL leveraging the open-source tools and platform of your choice. Learn how to use Azure Database for MySQL with our quickstarts, tutorials, and samples.\n"}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/mariadb/", "name": "Azure Database for MariaDB", "abstract": "\nAzure Database for MariaDB is a relational database service based on the open-source MariaDB Server engine.  It's a fully managed database as a service offering that can handle mission-critical workloads with predictable performance and dynamic scalability. Develop applications with Azure Database for MariaDB leveraging the open-source tools and platform of your choice. Learn how to use Azure Database for MariaDB with our quickstarts, tutorials, and samples.\n"}, {"category": ["Databases", "Migration"], "docs_url": "https://docs.microsoft.com/en-us/azure/dms/dms-overview", "name": "Azure Database Migration Service", "abstract": "The Azure Database Migration Service is a fully managed service designed to enable seamless migrations from multiple database sources to Azure data platforms with minimal downtime (online migrations)."}, {"category": ["Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/container-registry/", "name": "Container Registry", "abstract": "\nAzure Container Registry allows you to build, store, and manage images for all types of container deployments. Learn how to use Azure Container Registry with these quickstarts, tutorials, and samples.\n"}, {"category": ["Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/container-instances/", "name": "Container Instances", "abstract": "\nAzure Container Instances offers the fastest and simplest way to run a container in Azure, without having to provision any virtual machines and without having to adopt a higher-level service. Learn how to create and manage container instances with our quickstarts, tutorials, and samples.If you require a complete container orchestration solution, see the Azure Kubernetes Service (AKS) documentation.\n"}, {"category": ["Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service/containers/", "name": "Web App for Containers", "abstract": "Learn how to deploy continuously:"}, {"category": ["Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/dev-spaces/", "name": "Azure Dev Spaces", "abstract": "With minimal dev machine setup, you can iteratively run and debug containers directly in Azure Kubernetes Service (AKS).  You can also collaborate with your team in a shared Kubernetes cluster, and do end-to-end testing with other components without replicating or mocking up dependencies. With Azure Dev Spaces, you can develop on Windows, Mac, or Linux using familiar tools like Visual Studio, Visual Studio Code, or the command line."}, {"category": ["Integration", "Internet of Things", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/api-management/", "name": "API Management", "abstract": "\nLearn how to use API Management to publish APIs to external, partner, and employee developers securely and at scale. Tutorials, API references, and other documentation show you how to create and manage modern API gateways for existing back-end services hosted anywhere.\n"}, {"category": ["Integration"], "docs_url": "https://docs.microsoft.com/en-us/azure/service-bus/", "name": "Service Bus", "abstract": "Learn how to use Service Bus and Relay to connect across on-premises and cloud environments. Tutorials, videos, API references, and other documentation show how to set up cloud messaging between applications and services."}, {"category": ["Integration", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/logic-apps/", "name": "Logic Apps", "abstract": "\nAzure Logic Apps simplifies how you build automated scalable workflows that integrate apps and data across cloud services and on-premises systems. Learn how to create, design, and deploy logic apps that automate business processes with our quickstarts, tutorials, templates, and APIs.\n"}, {"category": ["Integration", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/event-grid/", "name": "Event Grid", "abstract": "\nAzure Event Grid is a fully-managed intelligent event routing service that allows for uniform event consumption using a publish-subscribe model. Use Azure Event Grid to react to relevant events across both Azure and non-Azure services in near-real time fashion. Learn how to use Azure Event Grid with our quickstarts, tutorials, and samples.\n"}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/", "name": "Media Services", "abstract": "\nAzure Media Services (AMS) is a cloud-based platform that enables you to build solutions that achieve high-definition video encoding and broadcast-quality video streaming that reach your audiences on most popular devices. AMS v3 also enables you to extract the insights from your video and audio files with Video Indexer through AMS v3 analyzer presets. If you want more detailed insights, use Video Indexer directly. To understand when you would want to use Video Indexer vs. Media Services analyzer presets, check out the comparison document.\n"}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/media-services-encode-asset", "name": "Encoding", "abstract": "Azure Media Services provides multiple options for the encoding of media in the cloud."}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/media-services-manage-channels-overview", "name": "Live and On-Demand Streaming", "abstract": "When delivering live streaming events with Azure Media Services the following components are commonly involved:"}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/media-services-playback-content-with-existing-players", "name": "Azure Media Player", "abstract": "Azure Media Services supports many popular streaming formats, such as Smooth Streaming, HTTP Live Streaming, and MPEG-Dash. This topic points you to existing players that you can use to test your streams."}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/media-services-content-protection-overview", "name": "Content Protection", "abstract": " You can use Azure Media Services to secure your media from the time it leaves your computer through storage, processing, and delivery. With Media Services, you can deliver your live and on-demand content encrypted dynamically with Advanced Encryption Standard (AES-128) or any of the three major digital rights management (DRM) systems: Microsoft PlayReady, Google Widevine, and Apple FairPlay. Media Services also provides a service for delivering AES keys and DRM (PlayReady, Widevine, and FairPlay) licenses to authorized clients. "}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/media-services-analytics-overview", "name": "Media Analytics", "abstract": "More organizations are using video as the preferred medium to train their employees, engage their customers, and document business functions. Cloud computing provides a way to store, stream, and access these large media files. But as a company's library of video content grows, it needs an equally effective means of extracting insights from the content. "}, {"category": ["Media", "AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/video-indexer/video-indexer-overview", "name": "Video Indexer", "abstract": "Azure Video Indexer is a cloud application built on Azure Media Analytics, Azure Search, Cognitive Services (such as the Face API, Microsoft Translator, the Computer Vision API, and Custom Speech Service). It enables you to extract the insights from your videos using Video Indexer video and audio models described below:"}, {"category": ["Azure Stack"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-stack/", "name": "Azure Stack Operator", "abstract": "\nMicrosoft Azure Stack is a hybrid cloud platform that lets you provide Azure services from your datacenter. Learn how to manage the Azure Stack integrated systems infrastructure and how to offer services with our quickstarts and tutorials.If you're an Azure Stack user who uses services or builds apps for Azure Stack, see our user documentation.If you are an Azure Stack operator interested in the Azure Stack Development Kit (ASDK), a single-node deployment of Azure Stack that you can download and use for free, see our ASDK documentation.\n"}, {"category": ["Azure Stack"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-stack/user", "name": "Azure Stack User", "abstract": "\nAzure Stack is a hybrid cloud platform that lets you use Azure services from your company's or service provider's datacenter. As a developer, you can build apps on Azure Stack. You can then deploy them to Azure Stack, to Azure, or you can build truly hybrid apps that leverage the connectivity between an Azure Stack cloud and Azure. Learn how to create resources and deploy apps with our quickstarts and tutorials.If you're an Azure Stack operator who manages the infrastructure and offers services, see our operator documentation.If you are an Azure Stack operator interested in the Azure Stack Development Kit (ASDK), a single-node deployment of Azure Stack that you can download and use for free, see our ASDK documentation.\n"}, {"category": ["Sovereign Clouds"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-government/", "name": "Azure US Government", "abstract": "\nMicrosoft Azure Government delivers a cloud platform built upon the foundational principles of security, privacy and control, compliance, and transparency. Public Sector entities receive a physically isolated instance of Microsoft Azure that employs world-class security and compliance services critical to U.S. government for all systems and applications built on its architecture.\n"}, {"category": ["Sovereign Clouds"], "docs_url": "https://docs.microsoft.com/en-us/azure/germany/", "name": "Azure Germany", "abstract": "Microsoft Azure Germany is built on the Microsoft \"trusted cloud\" principles of security, privacy, compliance, and transparency. It brings data residency, in transit and at rest in Germany, and data replication across German datacenters for business continuity."}, {"category": ["Sovereign Clouds"], "docs_url": "https://docs.microsoft.com/en-us/azure/china/", "name": "Microsoft Azure China 21Vianet", "abstract": "Microsoft Azure operated by 21Vianet is a cloud platform, designed to comply with regulatory requirement in China, that contains a growing collection of integrated cloud services. The services that developers and IT professionals use to build, deploy, and manage applications. Azure China 21Vianet is a physically separated instance of cloud services that is located in mainland China, independently operated and transacted by Shanghai Blue Cloud Technology Co., Ltd. (\"21Vianet\")."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/networking/networking-overview", "name": "Networking Overview", "abstract": "Azure provides a variety of networking capabilities that can be used together or separately. Click any of the following key capabilities to learn more about them:"}, {"category": ["Networking", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/cdn/", "name": "Content Delivery Network", "abstract": "\nAzure Content Delivery Network (CDN) is a global CDN solution for delivering high-bandwidth content. It can be hosted in Azure or any other location. With Azure CDN, you can cache static objects loaded from Azure Blob storage, a web application, or any publicly accessible web server, by using the closest point of presence (POP) server. Azure CDN can also accelerate dynamic content, which cannot be cached, by leveraging various network and routing optimizations.\n"}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/expressroute/", "name": "ExpressRoute", "abstract": "\nLearn how to use ExpressRoute to set up a fast, private connection to Microsoft cloud services from your on-premises infrastructure or colocation facility. Tutorials, REST APIs, and other documentation help you configure and manage an ExpressRoute circuit.\n"}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/dns/", "name": "Azure DNS", "abstract": "\nLearn how to use Azure DNS. Quickstarts, tutorials, samples, and more, show you how to set up and manage DNS zones and records for domain names.\n"}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-network/", "name": "Virtual Network", "abstract": "\nLearn how to use Azure Virtual Network. Quickstarts, tutorials, samples, and more, show you how to deploy a virtual network, control traffic filtering and routing, and connect a virtual network to other virtual networks.\n"}, {"category": ["Networking", "Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/traffic-manager/", "name": "Traffic Manager", "abstract": "\nLearn how to use Azure Traffic Manager. Quickstarts, tutorials, samples, and more, show you how to manage incoming traffic for optimal application performance, and how to distribute traffic to Azure or external service endpoints.\n"}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/load-balancer/", "name": "Load Balancer", "abstract": "\nLearn how to use Azure Load Balancer. Quickstarts, tutorials, samples, and more, show you how to deploy a load balancer and load balance traffic to and from virtual machines and cloud resources, and in cross-premises virtual networks.\n"}, {"category": ["Networking", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/vpn-gateway/", "name": "VPN Gateway", "abstract": "\nLearn how to configure, create, and manage an Azure VPN gateway. Create encrypted cross-premises connections to your virtual network from on-premises locations, or create encrypted connections between VNets.\n"}, {"category": ["Networking", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/application-gateway/", "name": "Application Gateway", "abstract": "\nLearn how to deploy Application Gateway, an application delivery controller (ADC) as a service. Tutorials, API references, and other documentation show you how to set up application-level routing and load balancing services that let you build a scalable and highly-available web front end.\n"}, {"category": ["Networking", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-network/ddos-protection-overview", "name": "Azure DDoS protection", "abstract": "Distributed denial of service (DDoS) attacks are some of the largest availability and security concerns facing customers that are moving their applications to the cloud. A DDoS attack attempts to exhaust an application’s resources, making the application unavailable to legitimate users. DDoS attacks can be targeted at any endpoint that is publicly reachable through the internet."}, {"category": ["Networking", "Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/network-watcher/", "name": "Network Watcher", "abstract": "\nLearn how to use Azure Network Watcher. Quickstarts, tutorials, and more, show you how to gain insight into your Azure Virtual Network with tools like packet capture and NSG flows logs, to diagnose problems with traffic filtering and routing, and to monitor connections.\n"}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/firewall/", "name": "Azure Firewall", "abstract": "\nLearn how to deploy Azure Firewall, a cloud-based network security service. Tutorials, API references, and other documentation show you how to set up application-level and network-level policies to protect your Azure virtual network resources.\n"}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/frontdoor/", "name": "Azure Front Door Service", "abstract": "\nAzure Front Door Service provides a scalable and secure entry point for fast delivery of your global web applications. Learn how to use Front Door with our quickstarts, tutorials, and samples.\n"}, {"category": ["AI + Machine Learning", "Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-databricks/", "name": "Azure Databricks", "abstract": "\nLearn how to use Azure Databricks using the quickstart and other links provided here. Azure Databricks is an Apache Spark-based analytics platform optimized for the Microsoft Azure cloud services platform. Designed with the founders of Apache Spark, Databricks is integrated with Azure to provide one-click setup, streamlined workflows, and an interactive workspace that enables collaboration between data scientists, data engineers, and business analysts.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/genomics/", "name": "Microsoft Genomics", "abstract": "\nLearn how Microsoft Genomics can power genome sequencing using a cloud implementation of the Burrows-Wheeler Aligner (BWA) and the Genome Analysis Toolkit (GATK) for secondary analysis.\n"}, {"category": ["AI + Machine Learning", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/machine-learning/service", "name": "Machine Learning Services", "abstract": "\nAzure Machine Learning service provides SDKs and services to quickly prep data, train, and deploy machine learning models. Improve productivity and costs with autoscaling compute & pipelines. Use these capabilities with open-source Python frameworks, such as PyTorch, TensorFlow, and scikit-learn. Get started with our quickstarts and tutorials.\n"}, {"category": ["AI + Machine Learning", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/machine-learning/studio", "name": "Machine Learning Studio", "abstract": "\nAzure Machine Learning Studio is a collaborative, drag-and-drop tool for building, testing, and deploying predictive analytics solutions on your data. Tutorials, videos, and example models show you how to use Studio to build and deploy machine learning models.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/welcome", "name": "Cognitive Services", "abstract": "Azure Cognitive Services are APIs, SDKs, and services available to help developers build intelligent applications without having direct AI or data science skills or knowledge. Azure Cognitive Services expand on Microsoft’s evolving portfolio of machine learning APIs and enable developers to easily add cognitive features – such as emotion and video detection; facial, speech, and vision recognition; and speech and language understanding – into their applications. The goal of Azure Cognitive Services is to help developers create applications that can see, hear, speak, understand, and even begin to reason. The catalog of services within Azure Cognitive Services can be categorized into five main pillars - Vision, Speech, Language, Search, and Knowledge."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/notebooks", "name": "Azure Notebooks", "abstract": "\nAzure Notebooks is a free hosted service to develop and run Jupyter notebooks in the cloud with no installation. Jupyter (formerly IPython) is an open source project that lets you easily combine markdown text, executable code (Python, R, and F#), persistent data, graphics, and visualizations onto a single, sharable canvas called a notebook.\n"}, {"category": ["AI + Machine Learning", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/search/", "name": "Azure Search", "abstract": "\nLearn how to create an enterprise search solution over private, heterogenous content using Azure Search. Tutorials, API references, and other docs show you how to consolidate searchable content into a single fast index, queryable using simple-to-advanced syntax for a broad range of scenarios. New cognitive search preview. Use a pre-release REST API to bind AI-powered algorithms to the indexing pipeline. Extract data, and invoke natural language and image processing to transform raw unstructured content into searchable content in an Azure Search index. Explore cognitive search using resources and sample data or learn more in Concepts.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/computer-vision/", "name": "Computer Vision API", "abstract": "\nThe cloud-based Computer Vision API provides developers with access to advanced algorithms for processing images and returning information. By uploading an image or specifying an image URL, Microsoft Computer Vision algorithms can analyze visual content in different ways based on inputs and user choices. Learn how to analyze visual content in different ways with quickstarts, tutorials, and samples.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/content-moderator/overview", "name": "Content Moderator", "abstract": "The Azure Content Moderator API is a cognitive service that checks text, image, and video content for material that is potentially offensive, risky, or otherwise undesirable. When such material is found, the service applies appropriate labels (flags) to the content. Your app can then handle flagged content in order to comply with regulations or maintain the intended environment for users. See the Content Moderator APIs section to learn more about what the different content flags indicate."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/Custom-Vision-Service/home", "name": "Custom Vision Service", "abstract": "Azure Custom Vision is a cognitive service that lets you build, deploy and improve your own image classifiers. An image classifier is an AI service that applies labels (which represent classes) to images, according to their visual characteristics. Unlike the Computer Vision service, Custom Vision allows you to determine the labels to apply."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/emotion/home", "name": "Emotion API", "abstract": "The Azure Face API is a cognitive service that provides algorithms for detecting, recognizing, and analyzing human faces in images. The ability to process human face information is important in many different software scenarios, such as security, natural user interface, image content analysis and management, mobile apps, and robotics."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/face/", "name": "Face API", "abstract": "\nThe cloud-based Face API provides developers with access to advanced face algorithms. Microsoft Face algorithms enable face attribute detection and face recognition. Learn how to analyze content in different ways with quickstarts, tutorials, and samples.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/speech-service/overview", "name": "Speech Service", "abstract": "Like the other Azure speech services, Speech Services are powered by speech technologies used in products like Cortana and Microsoft Office."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/speech/home", "name": "Speech API", "abstract": "The cloud-based Microsoft Bing Speech API provides developers an easy way to create powerful speech-enabled features in their applications, like voice command control, user dialog using natural speech conversation, and speech transcription and dictation. The Microsoft Speech API supports both Speech to Text and Text to Speech conversion."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/custom-speech-service/cognitive-services-custom-speech-home", "name": "Custom Speech Service", "abstract": "Use this article to migrate your applications from the Custom Speech Service to the Speech Service."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/speaker-recognition/home", "name": "Speaker Recognition API", "abstract": "Welcome to the Azure Cognitive Services Speaker Recognition APIs. Speaker Recognition APIs are cloud-based APIs that provide the most advanced algorithms for speaker verification and speaker identification. Speaker Recognition can be divided into two categories: speaker verification and speaker identification."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/translator-speech/", "name": "Translator Speech API", "abstract": "The Translator Speech API can be used to add end-to-end, real-time, speech translations to applications, tools, or any solution requiring multi-language speech translation regardless of the target OS or development languages. The API can be used for both speech to speech and speech to text translation."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-spell-check/", "name": "Bing Spell Check API", "abstract": "\nThe Bing Spell Check API lets you perform contextual grammar and spell checking. Bing has developed a web-based spell-checker that leverages machine learning and statistical machine translation to dynamically train a constantly evolving and highly contextual algorithm. The spell-checker is based on a massive body of web searches and documents. Learn how to analyze content in different ways with our quickstarts, tutorials, and samples.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/luis/", "name": "Language Understanding (LUIS)", "abstract": "\nLanguage Understanding service (LUIS) allows your application to understand what a person wants in their own words. LUIS uses machine learning to allow developers to build applications that can receive user input in natural language and extract meaning from it.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/linguisticanalysisapi/home", "name": "Linguistic Analysis API", "abstract": "The Linguistic Analysis API provides access to natural language processing (NLP) tools that identify the structure of text. The current release provides three types of analysis:"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/text-analytics/", "name": "Text Analytics API", "abstract": "\nThe Text Analytics API is a cloud-based service that provides advanced natural language processing over raw text, and includes three main functions: sentiment analysis, key phrase extraction, and language detection. Learn how to analyze content in different ways with our quickstarts, tutorials, and samples.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/translator/", "name": "Translator Text API", "abstract": "\nTranslator Text is a cloud-based machine translation service you can use to translate text in near real-time through a simple REST API call. The API uses modern neural machine translation technology and offers statistical machine translation technology. Custom Translator is an extension of the Translator Text API which allows you to build neural translation systems. The customized translation system can be used to translate text with the Translator Text API or  Microsoft Speech Services. For the list of supported languages, both for neural and statistical machine translation, see Supported languages.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/web-language-model/home", "name": "Web Language Model API", "abstract": "The Microsoft Web Language Model API is a REST-based cloud service providing state-of-the-art tools for natural language processing. Using this API, your application can leverage the power of big data through language models trained on web-scale corpora collected by Bing in the en-US market."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/custom-decision-service/custom-decision-service-overview", "name": "Custom Decision Service", "abstract": "In a typical web or mobile application, a front page links to several articles or other types of content. As the front page loads, it could request the Custom Decision Service to rank articles included on that front page. So, when a user chooses an article by clicking on it, a second request could be sent to the Custom Decision Service, which will log the outcome of that user decision."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/qnamaker/home", "name": "QnA Maker API", "abstract": "\nQnA Maker is a cloud-based API service that creates a conversational, question-and-answer layer over your data. QnA Maker enables you to power a question-and-answer service from your semi-structured content like FAQ documents, URLs, and product manuals. The QnA Maker service answers your users' natural language questions by matching it with the best possible answer from the QnAs in your Knowledge base.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/recommendations/overview", "name": "Recommendations API", "abstract": "The Recommendations API preview is no longer under active development and was officially retired on February 15. "}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/kes/overview", "name": "Knowledge Exploration Service (KES)", "abstract": "Welcome to the Microsoft Knowledge Exploration Service.  Knowledge Exploration Service (KES) offers a fast and effective way to add interactive search and refinement to applications.  With KES, you can build a compressed index from structured data, author a grammar that interprets natural language queries, and provide interactive query formulation with auto-completion suggestions."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/academic-knowledge/home", "name": "Academic Knowledge API", "abstract": "Welcome to the Academic Knowledge API. With this service, you will be able to interpret user queries for academic intent and retrieve rich information from the Microsoft Academic Graph (MAG). The MAG knowledge base is a web-scale heterogeneous entity graph comprised of entities that model scholarly activities: field of study, author, institution, paper, venue, and event. "}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/entitylinking/home", "name": "Entity Linking Intelligence Service API", "abstract": "Welcome to the Entity Linking Intelligence Service, a web service created to help developers with tasks relating to entity linking."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/labs/url-preview/overview", "name": "URL Preview", "abstract": "The URL Preview endpoint takes a URL query parameter and returns a JSON response with the name of the target resource, a brief description, and a link to an image to display in a preview. The response also includes the isFamilyFriendly flag that indicates whether the URL contains adult, pirated, or other illegal content. "}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/labs/answer-search/overview", "name": "Answer Search", "abstract": "Project Answer Search API uses the Bing v7 endpoint to get answers to interrogative queries. A question such as \"What is the circumference of the earth?\" returns an answer with factual information.  A query for a person, place, or thing returns information about the entity identified by the query. These scenarios can be useful in applications such as conversational bots, messaging apps, readers, etc.  "}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/labs/anomaly-finder/overview", "name": "Anomaly Finder", "abstract": "Anomaly Finder enables you to monitor data over time and detect anomalies with machine learning that adapts to your unique data by automatically applying the right statistical model regardless of industry, scenario, or data volume. Using a time series as input, the Anomaly Finder API returns whether or not a data point is an anomaly, determines the expected value, and upper and lower bounds for visualization. \nAs a prebuilt AI service, Anomaly Finder doesn’t require any machine learning expertise beyond understanding how to use a RESTful API. This makes development simple and versatile since it works with any time series data and can also be built into streaming data systems. Anomaly Finder encompasses a broad span of use cases – for instance, financial tools for managing fraud, theft, changing markets, and potential business incidents, or monitoring IoT device traffic while preserving anonymity. This solution can also be monetized as part of a service for end-customers to understand changes in data, spending, return on investment, or user activity.\nTry out the Anomaly Finder API and gain deeper understanding of your data. "}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/labs/conversation-learner/overview", "name": "Conversation Learner", "abstract": "Conversation Learner enables you to build and teach conversational interfaces that learn from example interactions. "}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-news-search/", "name": "Bing News Search API", "abstract": "\nThe Bing News Search API enables you to integrate Bing's news search capabilities in your applications. By sending search queries with the API, you can get relevant news articles from multiple categories and sources, similar to bing.com/news.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/Bing-Video-Search/", "name": "Bing Video Search API", "abstract": "\nThe Bing Video Search API enables you to integrate Bing's video search capabilities in your applications. By sending search queries to the API, you can get and display relevant and high-quality videos similar to bing.com/videos.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-web-search/", "name": "Bing Web Search API", "abstract": "\nThe Bing Web Search API enables you to integrate Bing's search capabilities in your applications. By sending search queries with the API, you can get relevant webpages, images, videos, news and more.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-visual-search/", "name": "Bing Visual Search API", "abstract": "\nThe Bing Visual Search API provides similar image details to those shown on Bing.com/images. By uploading an image or providing an image URL, the API can identify a variety of details about it, including visually similar images, shopping sources, webpages that include the image, and more.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/Bing-Autosuggest/", "name": "Bing Autosuggest API", "abstract": "\nBing Autosuggest API lets you send a partial search query term to Bing and get back a list of suggested queries that other users have searched on.  For example, as users type each character of their search term, you can call this API to populate the search box's drop-down list with suggestions. Learn how to use Autosuggest API with our quickstarts, tutorials, and samples.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-custom-search/", "name": "Bing Custom Search API", "abstract": "\nUse the Bing Custom Search API to create a search instance for topics that you care about. Specify the domains and webpages to be searched and adjust search rankings to fully customize your search experience.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-entities-search/", "name": "Bing Entity Search API", "abstract": "\nThe Bing Entity Search API enables your applications to get information about detected entities in search queries. Entities can be people, places, media titles, and more.\n"}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-image-search/", "name": "Bing Image Search API", "abstract": "\nThe Bing Image Search API enables you to integrate Bing's image search capabilities in your applications. By sending user search queries with the API, you can get and display relevant and high-quality images similar to bing.com/images.\n"}, {"category": ["Migration", "Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/site-recovery/", "name": "Site Recovery", "abstract": "\nAzure Site Recovery orchestrates and manages disaster recovery for Azure VMs, and on-premises VMs and physical servers. Learn how to replicate, fail over, and fail back with our quickstarts and tutorials.\n"}, {"category": ["Migration", "Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/cost-management/", "name": "Cost Management", "abstract": "\nAzure Cost Management is a cost management solution that helps you monitor and control Azure spending and optimize resource use. Learn how to analyze costs, create and manage budgets, export data, and review and act on recommendations with our quickstarts and tutorials.\n"}, {"category": ["Migration", "Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/migrate/migrate-overview", "name": "Azure Migrate", "abstract": "The Azure Migrate service assesses on-premises workloads for migration to Azure. The service assesses the migration suitability of on-premises machines, performs performance-based sizing, and provides cost estimations for running on-premises machines in Azure. If you're contemplating lift-and-shift migrations, or are in the early assessment stages of migration, this service is for you. After the assessment, you can use services such as Azure Site Recovery and Azure Database Migration Service, to migrate the machines to Azure."}, {"category": ["Mixed Reality", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/digital-twins/", "name": "Azure Digital Twins", "abstract": "\nLearn how to use Azure Digital Twins to connect people, places, and things, and to build IoT solutions with spatial intelligence. Walk through the Quickstart and Tutorials to monitor an imaginary smart building, learn in-depth concepts, and create a next generation IoT solution that models your physical environment.\n"}, {"category": ["Mixed Reality"], "docs_url": "https://docs.microsoft.com/en-us/azure/spatial-anchors/", "name": "Azure Spatial Anchors", "abstract": "\nSpatial Anchors is a cross-platform developer service that allows you to create mixed reality experiences using objects that persist their location across devices over time.\n"}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/", "name": "Storage", "abstract": "\nAzure Storage is a Microsoft-managed service providing cloud storage that is highly available, secure, durable, scalable, and redundant. Azure Storage includes Azure Blobs (objects), Azure Data Lake Storage Gen2, Azure Files, Azure Queues, and Azure Tables. Learn how to leverage Azure Storage in your applications with our quickstarts and tutorials.\n"}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storsimple/", "name": "StorSimple", "abstract": "Learn how to use Azure StorSimple, an integrated storage solution that manages storage tasks between on-premises devices and Azure cloud storage. Tutorials and other documentation show you how to set up storage management, location-independent backup, and disaster recovery."}, {"category": ["Storage", "Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/blobs/data-lake-storage-introduction", "name": "Data Lake Storage Gen2", "abstract": "‎Azure Data Lake Storage Gen2 is a set of capabilities dedicated to big data analytics, built on Azure Blob\nstorage. Data Lake Storage Gen2 is the result of converging the capabilities of our two existing storage services, Azure Blob storage and Azure Data Lake Storage Gen1. Features from Azure Data Lake Storage Gen1, such as file system semantics, directory, and file level security and scale are combined with low-cost, tiered storage, high availability/disaster recovery capabilities from Azure Blob storage."}, {"category": ["Storage", "Analytics", "Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-lake-store/", "name": "Data Lake Storage Gen1", "abstract": "Azure Data Lake Storage Gen2 is now generally available. We recommend that you start using it today. For more information, see the product page."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blobs-introduction", "name": "Blob Storage", "abstract": "Azure Blob storage is Microsoft's object storage solution for the cloud. Blob storage is optimized for storing massive amounts of unstructured data. Unstructured data is data that does not adhere to a particular data model or definition, such as text or binary data. "}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/managed-disks-overview", "name": "Disk Storage", "abstract": "An Azure managed disk is a virtual hard disk (VHD). You can think of it like a physical disk in an on-premises server but, virtualized. Azure managed disks are stored as page blobs, which are a random IO storage object in Azure. We call a managed disk ‘managed’ because it is an abstraction over page blobs, blob containers, and Azure storage accounts. With managed disks, all you have to do is provision the disk, and Azure takes care of the rest."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/managed-disks-overview", "name": "Managed Disks", "abstract": "An Azure managed disk is a virtual hard disk (VHD). You can think of it like a physical disk in an on-premises server but, virtualized. Azure managed disks are stored as page blobs, which are a random IO storage object in Azure. We call a managed disk ‘managed’ because it is an abstraction over page blobs, blob containers, and Azure storage accounts. With managed disks, all you have to do is provision the disk, and Azure takes care of the rest."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/queues/storage-queues-introduction", "name": "Queue Storage", "abstract": "Azure Queue storage is a service for storing large numbers of messages that can be accessed from anywhere in the world via authenticated calls using HTTP or HTTPS. A single queue message can be up to 64 KB in size, and a queue can contain millions of messages, up to the total capacity limit of a storage account."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/files/storage-files-introduction/", "name": "File Storage", "abstract": "Azure Files offers fully managed file shares in the cloud that are accessible via the industry standard Server Message Block (SMB) protocol. Azure file shares can be mounted concurrently by cloud or on-premises deployments of Windows, Linux, and macOS. Additionally, Azure file shares can be cached on Windows Servers with Azure File Sync for fast access near where the data is being used."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/databox-family/", "name": "Data Box", "abstract": "Azure Data Box\nThe Azure Data Box family offers products of differing storage capacities to help send terabytes (TB) of data to Azure in a quick, inexpensive, and reliable way. Microsoft accelerates secure data transfer by shipping you proprietary storage devices that enable offline or over the network data transfer."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/avere-vfxt/", "name": "Avere vFXT", "abstract": "\nAvere vFXT for Azure provides a cloud-based cache layer for data-intensive high performance computing (HPC) tasks. By caching files close to your compute nodes, Avere vFXT speeds read times and lets you work more smoothly even at peak load. Avere vFXT works best with systems that have between 1,000 and 40,000 client cores. Avere vFXT can work with your existing on-premises data storage to provide Azure-based computing resources local access to active files that are stored long-term in your datacenter.\n"}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/vs-azure-tools-storage-manage-with-storage-explorer?tabs=windows", "name": "Storage Explorer", "abstract": "Azure Storage Explorer is a standalone app that enables you to easily work with Azure Storage data on Windows, macOS, and Linux. In this article, you learn several ways of connecting to and managing your Azure storage accounts."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-storage-tiers", "name": "Archive Storage", "abstract": "Azure storage offers different storage tiers, which allow you to store Blob object data in the most cost-effective manner. The available tiers include:"}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-netapp-files/", "name": "Azure NetApp Files", "abstract": "Learn how to use Azure NetApp Files to create and manage NetApp accounts, capacity pools, and volumes, configure export policy, mount a volume for a virtual machine, and manage snapshots."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/hdinsight/", "name": "HDInsight", "abstract": "\nLearn how to use Azure HDInsight to analyze streaming or historical data. Tutorials and other documentation show you how to create clusters, process and analyze big data, and develop solutions using the most popular open-source frameworks, like Apache Hadoop, Apache Spark, Apache Hive, Apache LLAP, Apache Kafka, Apache Storm, and Microsoft Machine Learning Server.Azure HDInsight is a fully managed, full-spectrum, open-source analytics service for enterprises. HDInsight is a cloud service that makes it easy, fast, and cost-effective to process massive amounts of data. HDInsight also supports a broad range of scenarios, like extract, transform, and load (ETL); data warehousing; machine learning; and IoT.\n"}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-explorer/", "name": "Azure Data Explorer", "abstract": "\nAzure Data Explorer is a fast and highly scalable data exploration service for log and telemetry data. It helps you handle the many data streams emitted by modern software, so you can collect, store, and analyze data. Azure Data Explorer is ideal for analyzing large volumes of diverse data from any data source, such as websites, applications, IoT devices, and more.Learn how to use Azure Data Explorer with our quickstarts, tutorials, and reference content.\n"}, {"category": ["Analytics", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/stream-analytics/", "name": "Stream Analytics", "abstract": "\nLearn how to run Internet of Things (IoT) analytics in the cloud with Stream Analytics, a fully managed event-processing engine. Tutorials and other documentation show you how to analyze data in real time from applications, sensors, devices, social media, and more.\n"}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-lake-analytics/", "name": "Data Lake Analytics", "abstract": "Learn how to use Azure Data Lake Analytics to run big data analysis jobs that scale to massive data sets. Tutorials and other documentation show you how to create and manage batch, real-time, and interactive analytics jobs, and how to query using the U-SQL language."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/event-hubs/", "name": "Event Hubs", "abstract": "\nAzure Event Hubs is a Big Data streaming platform and event ingestion service, capable of receiving and processing millions of events per second. Event Hubs can process and store events, data, or telemetry produced by distributed software and devices. Data sent to an event hub can be transformed and stored by using any real-time analytics provider or batching/storage adapters. Event Hubs for Apache Kafka enables native Kafka clients, tools, and applications such as Mirror Maker, Apache Flink, and Akka Streams to work seamlessly with Event Hubs with only configuration changes.\n"}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/power-bi-embedded/", "name": "Power BI Embedded", "abstract": "Learn how to add data visualizations and interactive reports to applications with Power BI Embedded. Tutorials, API references, and other documentation show you how to seamlessly embed Power BI reports and dashboards into apps."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/analysis-services/", "name": "Azure Analysis Services", "abstract": "Learn how to set up and manage data modeling with Analysis Services. Tutorials and other documentation show you how to create an enterprise-grade BI solution using tabular data in the cloud or on-premises."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/hdinsight/spark/apache-spark-overview", "name": "Apache Spark for Azure HDInsight", "abstract": "Apache Spark is a parallel processing framework that supports in-memory processing to boost the performance of big-data analytic applications. Apache Spark in Azure HDInsight is the Microsoft implementation of Apache Spark in the cloud. HDInsight makes it easier to create and configure a Spark cluster in Azure. Spark clusters in HDInsight are compatible with Azure Storage and Azure Data Lake Storage. So you can use HDInsight Spark clusters to process your data stored in Azure. For the components and the versioning information, see Apache Hadoop components and versions in Azure HDInsight."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/hdinsight/storm/apache-storm-overview", "name": "Apache Storm for  HDInsight", "abstract": "Apache Storm is a distributed, fault-tolerant, open-source computation system. You can use Storm to process streams of data in real time with Apache Hadoop. Storm solutions can also provide guaranteed processing of data, with the ability to replay data that was not successfully processed the first time."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/hdinsight/r-server/r-server-overview", "name": "R Server for HDInsight", "abstract": "Microsoft Machine Learning Server is available as a deployment option when you create HDInsight clusters in Azure. The cluster type that provides this option is called ML Services. This capability provides data scientists, statisticians, and R programmers with on-demand access to scalable, distributed methods of analytics on HDInsight."}, {"category": ["Analytics", "Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/log-analytics/", "name": "Log Analytics", "abstract": "Azure Monitor maximizes the availability and performance of your applications by delivering a comprehensive solution for collecting, analyzing, and acting on telemetry from your cloud and on-premises environments. It helps you understand how your applications are performing and proactively identifies issues affecting them and the resources they depend on."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-catalog/", "name": "Data Catalog", "abstract": "Learn how to use Data Catalog to help your organization and team discover, understand, and consume your data sources. Tutorials, REST API reference, and other documentation show you how to plan and set up your data repository where data consumers can discover available data sources and gain knowledge contributed by subject matter experts."}, {"category": ["DevOps", "Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/devops/", "name": "Azure DevOps", "abstract": "Azure DevOps Services provides development collaboration tools including high-performance pipelines, free private Git repositories, configurable Kanban boards, and extensive automated and cloud-based load testing. For the on-premises platform, Azure DevOps Server (previously named Visual Studio Team Foundation Server), see Azure DevOps Server Documentation."}, {"category": ["DevOps", "Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/application-insights/", "name": "Application Insights", "abstract": "Azure Monitor maximizes the availability and performance of your applications by delivering a comprehensive solution for collecting, analyzing, and acting on telemetry from your cloud and on-premises environments. It helps you understand how your applications are performing and proactively identifies issues affecting them and the resources they depend on."}, {"category": ["DevOps"], "docs_url": "https://docs.microsoft.com/en-us/azure/lab-services/", "name": "Azure Lab Services", "abstract": "\nLearn how to use Azure Lab Services to quickly set up a development, test, hackathon, or a classroom lab for your team or students in the cloud. Azure Tutorials, samples, and more show you how to create, manage, and secure labs.\n"}, {"category": ["DevOps", "Mobile"], "docs_url": "https://docs.microsoft.com/en-us/appcenter/", "name": "Visual Studio App Center", "abstract": "\nVisual Studio App Center brings together multiple services commonly used by mobile developers into an integrated cloud solution. Developers use App Center to Build, Test, and Distribute applications. Once the app's deployed, developers monitor the status and usage of the app using the Analytics and Diagnostics services, and engage with users using the Push service.\n"}, {"category": ["DevOps", "Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/integrations", "name": "Developer Tool Integrations", "abstract": "\n\n"}, {"category": ["DevOps"], "docs_url": "https://docs.microsoft.com/en-us/azure/devops-project", "name": "Azure DevOps Projects", "abstract": "\nAzure DevOps Projects presents a simplified experience where you bring your existing code and Git repository, or choose from one of the sample applications to create a continuous integration (CI) and continuous delivery (CD) pipeline to Azure.\n"}, {"category": ["Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/visualstudio/products", "name": "Visual Studio", "abstract": "Build apps and games, using Windows, to reach every device with Android, iOS, Windows, web or cloud."}, {"category": ["Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/sdks", "name": "SDKs", "abstract": "\n\n"}, {"category": ["Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/cli", "name": "CLI", "abstract": "\n\n"}, {"category": ["Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/blockchain-workbench", "name": "Blockchain Workbench", "abstract": "\nLearn how to create blockchain applications. Tutorials, API references, and other documentation show you how to deploy Azure Blockchain Workbench to create and use blockchain applications on Azure.\n"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-fundamentals", "name": "Azure IoT", "abstract": "Azure Internet of Things (IoT) is a collection of Microsoft-managed cloud services that connect, monitor, and control billions of IoT assets."}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-central/", "name": "IoT Central", "abstract": "\nAzure IoT Central is a fully managed SaaS (software-as-a-service) solution that makes it easy to connect, monitor and manage your IoT assets at scale. Azure IoT Central simplifies the initial setup of your IoT solution and reduces the management burden, operational costs, and overhead of a typical IoT project. Learn how to create, customize, manage, and use an Azure IoT Central application with our quickstarts and tutorials.\n"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-hub/", "name": "IoT Hub", "abstract": "\nLearn how to use IoT Hub to connect, monitor, and control billions of Internet of Things assets. Tutorials, API references, videos and other documentation help you deploy reliable and bi-directional communication between IoT devices and a solution back-end.\n"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-edge/", "name": "IoT Edge", "abstract": "\nAzure IoT Edge is an Internet of Things (IoT) service that builds on top of IoT Hub. This service is meant for customers who want to analyze data on devices, a.k.a. \"at the edge\", instead of in the cloud. By moving parts of your workload to the edge, your devices can spend less time sending messages to the cloud and react more quickly to changes in status.\n"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-suite/", "name": "IoT solution accelerators", "abstract": "Learn how to use the IoT solution accelerators. These articles show you how to use the solution accelerators to kick-start your implementation of common IoT scenarios such as remote monitoring, industrial IoT, predictive maintenance, and device simulation."}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-dps/", "name": "IoT Hub Device Provisioning Service", "abstract": "\nThe IoT Hub Device Provisioning Service is a helper service for IoT Hub that enables zero-touch, just-in-time provisioning to the right IoT hub without requiring human intervention, allowing customers to provision millions of devices in a secure and scalable manner. Learn how to provision devices to your IoT hub(s) with our quickstarts, tutorials, and samples.\n"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/time-series-insights/", "name": "Time Series Insights", "abstract": "\nWelcome to Azure Time Series Insights. Azure Time Series Insights provides powerful data exploration and telemetry tools to help you refine operational analysis. The documentation describes the many features of the service, how to get started, and the powerful Time Series Insights APIs. Information is presented for two versions, one that is generally available (Time Series Insights GA) and one that is in preview (Time Series Insights Preview).\n"}, {"category": ["Internet of Things", "Mobile"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-maps/", "name": "Azure Maps", "abstract": "\nAzure Maps provides developers from all industries, powerful geospatial capabilities, packed with the freshest mapping data available to provide geographic context to web and mobile applications. Azure Maps is an Azure One API compliant set of REST APIs for Maps, Search, Routing, Traffic, Time Zones, Geolocation, Geofencing, Map Data and Spatial Operations accompanied by both Web and Android SDKs to make development easy, flexible, and portable across multiple platforms.\n"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/machine-learning/", "name": "Machine Learning", "abstract": "\nLearn how to build intelligent algorithms into apps and websites using these Azure Machine Learning products.  Tutorials, quickstarts, API references, and examples show you how.\n"}, {"category": ["Internet of Things", "Web", "Mobile"], "docs_url": "https://docs.microsoft.com/en-us/azure/notification-hubs/", "name": "Notification Hubs", "abstract": "\nLearn how to use Notification Hubs, a multi-platform, scalable push-notification engine to quickly send millions of messages to applications running on various types of devices (Android, iOS, Windows, Windows Phone, Baidu, Kindle). Tutorials, API references, and other documentation show you how to set up and send push notifications from any backend to any mobile device.\n"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure-sphere/", "name": "Azure Sphere", "abstract": "Azure Sphere is a secured, high-level application platform with built-in communication and security features for internet-connected devices. It comprises an Azure Sphere microcontroller unit (MCU), tools and an SDK for developing applications, and the Azure Sphere Security Service, through which applications can securely connect to the cloud and web."}, {"category": ["Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service-web/", "name": "App Service - Web Apps", "abstract": "\nAzure App Service enables you to build and host web apps, mobile back ends, and RESTful APIs in the programming language of your choice without managing infrastructure. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. Learn how to use Azure App Service with our quickstarts, tutorials, and samples.\n"}, {"category": ["Web", "Mobile"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service-api/", "name": "API Apps", "abstract": "\nAzure App Service enables you to build and host web apps, mobile back ends, and RESTful APIs in the programming language of your choice without managing infrastructure. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. Learn how to use Azure App Service with our quickstarts, tutorials, and samples.\n"}, {"category": ["Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-signalr/", "name": "Azure SignalR Service", "abstract": "\nAzure SignalR Service is an Azure managed service that helps developers easily build web applications with real-time features.\n"}, {"category": ["Mobile"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service-mobile/", "name": "App Service - Mobile Apps", "abstract": "Learn how to use Mobile Apps in Azure App Service to build native iOS, Android, or Windows apps, or cross-platform apps using Xamarin or Cordova. Tutorials, videos, client SDK documentation, and more show you how to build and host the backend for any mobile app."}, {"category": ["Security", "Identity"], "docs_url": "https://docs.microsoft.com/en-us/azure/security/", "name": "Security Information", "abstract": "Security is integrated into every aspect of Azure. Azure offers you unique security advantages derived from global security intelligence, sophisticated customer-facing controls, and a secure hardened infrastructure. This powerful combination helps protect your applications and data, support your compliance efforts, and provide cost-effective security for organizations of all sizes."}, {"category": ["Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/security-center", "name": "Security Center", "abstract": "\nAzure Security Center provides unified security management and advanced threat protection across hybrid cloud workloads. Learn how to get started with Security Center, apply security policies across your workloads, limit your exposure to threats, and detect and respond to attacks with our quickstarts and tutorials.\n"}, {"category": ["Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/key-vault/", "name": "Key Vault", "abstract": "\nLearn how to use Key Vault to safeguard and manage cryptographic keys and secrets used by cloud applications and services. Tutorials, API references, and other documentation show you how to create and maintain keys and secrets that access and encrypt your resources and solutions.\n"}, {"category": ["Security", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/dedicated-hsm", "name": "Azure Dedicated HSM", "abstract": "\nLearn about Dedicated HSM functionality and whether it applies to your environment.\n"}, {"category": ["Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/security/azure-threat-detection", "name": "Azure Advanced Threat Protection", "abstract": "Azure offers built in advanced threat detection functionality through services such as Azure Active Directory (Azure AD), Azure Monitor logs, and Azure Security Center. This collection of security services and capabilities provides a simple and fast way to understand what is happening within your Azure deployments."}, {"category": ["Security", "Identity"], "docs_url": "https://docs.microsoft.com/en-us/azure/information-protection/", "name": "Azure Information Protection", "abstract": "\nControl and help secure email, documents, and sensitive data that you share outside your company walls. From easy classification to embedded labels and permissions, enhance data protection at all times with Azure Information Protection, no matter where it's stored or who it's shared with.\n"}, {"category": ["Security", "Identity"], "docs_url": "https://docs.microsoft.com/en-us/azure/active-directory/", "name": "Azure Active Directory", "abstract": "Azure Active Directory (Azure AD) is a multi-tenant, cloud-based identity and access management service."}, {"category": ["Security", "Identity"], "docs_url": "https://docs.microsoft.com/en-us/azure/active-directory-domain-services", "name": "Azure Active Directory for Domain Services", "abstract": "Learn how to use Active Directory Domain Services to join Azure virtual machines to a domain without using domain controllers. Tutorials and other documentation show you how to manage virtual machines using group policies."}, {"category": ["Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/role-based-access-control/", "name": "Role-based access control", "abstract": "\nRole-based access control (RBAC) is a system that provides fine-grained access management of Azure resources. Using RBAC, you can segregate duties within your team and grant only the amount of access to users that they need to perform their jobs.\n"}, {"category": ["Identity"], "docs_url": "https://docs.microsoft.com/en-us/azure/multi-factor-authentication/", "name": "Multi-Factor Authentication", "abstract": "\nLearn how to deploy and manage Azure Active Directory self-service password reset, Multi-Factor Authentication, custom banned password list, and smart lockout. These features come together to deliver strong authentication with a range of verification methods while providing a simple sign-in process to your organization.\n"}, {"category": ["Identity"], "docs_url": "https://docs.microsoft.com/en-us/azure/active-directory-b2c", "name": "Azure Active Directory B2C", "abstract": "\nAzure Active Directory (Azure AD) B2C is an identity management service that enables you to customize and control how customers sign up, sign in, and manage their profiles when using your applications. This includes applications developed for iOS, Android, and .NET, among others. Azure AD B2C enables these actions while protecting the identities of your customers at the same time. Learn how to use Azure AD B2C with our quickstarts, tutorials, and samples.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/backup/", "name": "Backup", "abstract": "\nUse Azure Backup to protect the data for on-premises servers, virtual machines, virtualized workloads, SQL server, SharePoint server, and more. Learn how to back up and restore your data with our quickstarts, tutorials and samples.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/advisor", "name": "Azure Advisor", "abstract": "\nAzure Advisor is a personalized cloud consultant that helps you follow best practices to optimize your Azure deployments. It analyzes your resource configuration and usage telemetry. It then recommends solutions to help improve the performance, security, and high availability of your resources while looking for opportunities to reduce your overall Azure spend.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/scheduler/", "name": "Scheduler", "abstract": "Learn how to use Scheduler to schedule and automatically invoke recurring jobs in the cloud. Tutorials, API references, and other documentation show you how to schedule and monitor jobs such as recurring application actions and routine maintenance."}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/automation/", "name": "Automation", "abstract": "\nLearn how to use Automation to configure and automate operational tasks across a hybrid environment. Tutorials, API references, and other documentation show you how to automate processes, perform update management, deliver desired state configuration, track changes, and collect inventory.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/monitoring-and-diagnostics/", "name": "Azure Monitor", "abstract": "\nAzure Monitor, which now includes Log Analytics and Application Insights, provides sophisticated tools for collecting and analyzing telemetry that allow you to maximize the performance and availability of your cloud and on-premises resources and applications. It helps you understand how your applications are performing and proactively identifies issues affecting them and the resources they depend on.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/security/", "name": "Security & Compliance", "abstract": "Security is integrated into every aspect of Azure. Azure offers you unique security advantages derived from global security intelligence, sophisticated customer-facing controls, and a secure hardened infrastructure. This powerful combination helps protect your applications and data, support your compliance efforts, and provide cost-effective security for organizations of all sizes."}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/service-health", "name": "Azure Service Health", "abstract": "Azure Service Health is a suite of experiences that provide personalized guidance and support when issues in Azure services affect you. It can notify you, help you understand the impact of issues, and keep you updated as the issue resolves. It can also help you prepare for planned maintenance and changes that could affect the availability of your resources."}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-resource-manager/", "name": "Azure Resource Manager", "abstract": "\nLearn how to use Resource Manager to deploy, monitor, and manage solution resources as a group. Tutorials, API references, and other documentation show you how to set up resource groups and create templates for consistent and repeatable deployment.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/cloud-shell/overview", "name": "Cloud Shell", "abstract": "Azure Cloud Shell is an interactive, browser-accessible shell for managing Azure resources.\nIt provides the flexibility of choosing the shell experience that best suits the way you work.\nLinux users can opt for a Bash experience, while Windows users can opt for PowerShell."}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service-mobile", "name": "Azure mobile app", "abstract": "Learn how to use Mobile Apps in Azure App Service to build native iOS, Android, or Windows apps, or cross-platform apps using Xamarin or Cordova. Tutorials, videos, client SDK documentation, and more show you how to build and host the backend for any mobile app."}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/governance/policy/", "name": "Azure Policy", "abstract": "\nAzure Policy helps you manage and prevent IT issues with policy definitions that enforce rules and effects for your resources. When you use Azure Policy, resources stay compliant with your corporate standards and service level agreements.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/governance/blueprints/", "name": "Azure Blueprints", "abstract": "\nAzure Blueprints helps you deploy and update cloud environments in a repeatable manner using composable artifacts such as policies, role-based access control and Azure Resource Manager templates.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/governance/resource-graph/", "name": "Azure Resource Graph", "abstract": "\nAzure Resource Graph documentation helps you configure and learn the query language to discover and explore your resources at scale.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/managed-applications", "name": "Azure Managed Applications", "abstract": "\nAzure Managed Applications enables you to offer your cloud solutions to internal and external customers. You define the infrastructure for the solution, and the terms for ongoing management of the solution. The billing for your solution is handled through Azure billing.\n"}, {"category": ["Management Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/billing/", "name": "Billing", "abstract": "Learn how to understand your Azure billing, monitor usage and costs, and manage your account and subscriptions."}], "categories": ["AI + Machine Learning", "Analytics", "Azure Stack", "Compute", "Containers", "Databases", "DevOps", "Developer Tools", "Identity", "Integration", "Internet of Things", "Management Tools", "Media", "Migration", "Mixed Reality", "Mobile", "Networking", "Security", "Sovereign Clouds", "Storage", "Web"]}