{"last_updated": "May 18, 2020", "services": [{"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/anomaly-detector/", "name": "Anomaly Detector (Preview)", "abstract": "Anomaly Detector API Documentation\nLearn how to use the Anomaly Detector API to monitor data over time and detect anomalies with machine learning. Get insight into your data, regardless of volume, industry, or scenario."}, {"category": ["AI + Machine Learning", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/search/", "name": "Azure Cognitive Search", "abstract": "Azure Cognitive Search documentation\nCloud search over private heterogeneous content, with options for AI enrichment if your content is unstructured or unsearchable in raw form."}, {"category": ["AI + Machine Learning", "Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-databricks/", "name": "Azure Databricks", "abstract": "Azure Databricks documentation\nLearn Azure Databricks, an Apache Spark-based analytics platform with one-click setup, streamlined workflows, and an interactive workspace for collaboration between data scientists, engineers, and business analysts."}, {"category": ["AI + Machine Learning", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/machine-learning/", "name": "Azure Machine Learning", "abstract": "Azure Machine Learning documentation\nLearn how to train, deploy, and manage machine learning models, AutoML experiments, and pipelines at scale with Azure Machine Learning. Tutorials, code examples, API references, and more show you how."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/open-datasets/", "name": "Azure Open Datasets", "abstract": "Azure Open Datasets Documentation\nAzure Open Datasets is curated and cleansed data - including weather, census, and holidays - that you can use with minimal preparation to enrich ML models."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-autosuggest/get-suggested-search-terms", "name": "Bing Autosuggest", "abstract": "If your application sends queries to any of the Bing Search APIs, you can use the Bing Autosuggest API to improve your users' search experience. The Bing Autosuggest API returns a list of suggested queries based on the partial query string in the search box. As characters are entered into the search box, you can display suggestions in a drop-down list."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-custom-search/overview", "name": "Bing Custom Search", "abstract": "The Bing Custom Search API enables you to create tailored ad-free search experiences for topics that you care about. You can specify the domains and webpages for Bing to search, as well as pin, boost, or demote specific content to create a custom view of the web and help your users quickly find relevant search results."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-entities-search/overview", "name": "Bing Entity Search", "abstract": "The Bing Entity Search API sends a search query to Bing and gets results that include entities and places. Place results include restaurants, hotel, or other local businesses. Bing returns places if the query specifies the name of the local business or asks for a type of business (for example, restaurants near me). Bing returns entities if the query specifies well-known people, places (tourist attractions, states, countries/regions, etc.), or things."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-image-search/overview", "name": "Bing Image Search", "abstract": "The Bing Image Search API enables you to use Bing's image search capabilities in your application. By sending search queries to the API, you can get high-quality images similar to bing.com/images."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-news-search/search-the-web", "name": "Bing News Search", "abstract": "The Bing News Search API makes it easy to integrate Bing's cognitive news searching capabilities into your applications. The API provides a similar experience to Bing News, letting you send search queries and receive relevant news articles."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-spell-check/overview", "name": "Bing Spell Check", "abstract": "The Bing Spell Check API enables you to perform contextual grammar and spell checking on text. While most spell-checkers rely on dictionary-based rule sets, the Bing spell-checker leverages machine learning and statistical machine translation to provide accurate and contextual corrections."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-video-search/overview", "name": "Bing Video Search", "abstract": "The Bing Video Search API makes it easy to add video searching capabilities to your services and applications. By sending user search queries with the API, you can get and display relevant and high-quality videos similar to Bing Video. Use this API for search results that only contain videos. The Bing Web Search API can return other types of web content, including webpages, videos, news and images."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-visual-search/overview", "name": "Bing Visual Search", "abstract": "The Bing Visual Search API returns insights for an image. You can either upload an image or provide a URL to one. Insights are visually similar images, shopping sources, webpages that include the image, and more. Insights returned by the Bing Visual Search API are similar to ones shown on Bing.com/images."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/bing-web-search/overview", "name": "Bing Web Search", "abstract": "The Bing Web Search API is a RESTful service that provides instant answers to user queries. Search results are easily configured to include web pages, images, videos, news, translations, and more. Bing Web Search provides the results as JSON based on search relevance and your Bing Web Search subscriptions."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/", "name": "Cognitive Services", "abstract": "Learn how to build intelligent and supported algorithms into apps, websites, and bots to see, hear, speak, understand, and interpret your user needs."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/computer-vision/", "name": "Computer Vision", "abstract": "Computer Vision documentation\nThe cloud-based Computer Vision API provides developers with access to advanced algorithms for processing images and returning information. By uploading an image or specifying an image URL, Microsoft Computer Vision algorithms can analyze visual content in different ways based on inputs and user choices. Learn how to analyze visual content in different ways with quickstarts, tutorials, and samples."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/content-moderator/", "name": "Content Moderator", "abstract": "Content Moderator documentation\nThe Azure Content Moderator API is a cognitive service that checks text, image, and video content for material that is potentially offensive, risky, or otherwise undesirable. When such material is found, the service applies appropriate labels (flags) to the content. Your app can then handle flagged content in order to comply with regulations or maintain the intended environment for users."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/custom-vision-service/", "name": "Custom Vision", "abstract": "Custom Vision documentation\nCustom Vision lets you build, deploy, and improve your own image classifiers. An image classifier is an AI service that applies labels (which represent classes) to images, based on their visual characteristics."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/machine-learning/data-science-virtual-machine/", "name": "Data Science Virtual Machines", "abstract": "Azure Data Science Virtual Machine documentation\nThe Azure Data Science Virtual Machine (DSVM) is a virtual machine image pre-loaded with data science & machine learning tools. Use this VM to build intelligent applications for advanced analytics."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/face/", "name": "Face", "abstract": "Face documentation\nThe cloud-based Face service provides developers with access to advanced face algorithms. Microsoft Face algorithms enable face attribute detection and face recognition. Learn how to analyze content in different ways with quickstarts, tutorials, and samples."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/form-recognizer/", "name": "Form Recognizer (Preview)", "abstract": "Form Recognizer documentation\nAzure Form Recognizer is a cognitive service that uses machine learning technology to identify and extract key-value pairs and table data from form documents. It then outputs structured data that includes the relationships in the original file. Unsupervised learning allows the model to understand the layout and field data without manual data labeling or intensive coding. You can also do supervised learning with manually labeled data. Models trained with labeled data can perform better and can work with more complicated documents."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/immersive-reader/", "name": "Immersive Reader (Preview)", "abstract": "Immersive Reader documentation\nImmersive Reader is a tool that implements proven techniques to improve reading comprehension for emerging readers, language learners, and people with learning differences. You can use Immersive Reader in your web application by using the Immersive Reader SDK."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/ink-recognizer/", "name": "Ink Recognizer (Preview)", "abstract": "Ink Recognizer API documentation\nLearn how to use the ink recognizer API to bring digital ink recognition to your apps and services. The API is a cloud-based service that uses machine learning to recognize handwritten shapes and text in any context."}, {"category": ["AI + Machine Learning", "Internet of Things", "Mixed Reality"], "docs_url": "https://docs.microsoft.com/en-us/azure/kinect-dk/", "name": "Kinect DK", "abstract": "Azure Kinect DK documentation\nAzure Kinect DK is a developer kit with advanced AI sensors that provide sophisticated computer vision and speech models. Kinect contains a depth sensor, spatial microphone array with a video camera, and orientation sensor as an all in-one small device with multiple modes, options, and software development kits (SDKs)."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/luis/", "name": "Language Understanding", "abstract": "Language Understanding (LUIS) documentation\nLearn how Language Understanding enables your applications to understand what a person wants in their own words."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/genomics/", "name": "Microsoft Genomics", "abstract": "Microsoft Genomics documentation\nLearn how Microsoft Genomics can power genome sequencing using a cloud implementation of the Burrows-Wheeler Aligner (BWA) and the Genome Analysis Toolkit (GATK) for secondary analysis."}, {"category": ["AI + Machine Learning", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/machine-learning/studio/", "name": "ML Studio (Classic)", "abstract": "Azure Machine Learning Studio (classic) documentation\nMachine Learning Studio (classic) is a drag-and-drop tool you can use to build, test, and deploy predictive analytics solutions."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/personalizer/", "name": "Personalizer", "abstract": "Personalizer documentation\nLearn how to use Personalizer to allow your application to choose the best experience to show to your users, learning from their real-time behavior."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/qnamaker/", "name": "QnA Maker", "abstract": "QnA Maker documentation\nLearn about the QnA Maker service and how this service's knowledge bases work with your questions and answers."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/speaker-recognition/home", "name": "Speaker Recognition (Preview)", "abstract": "Speaker Recognition APIs are cloud-based APIs that provide the advanced AI algorithms for speaker verification and speaker identification. Speaker Recognition is divided into two categories: speaker verification and speaker identification."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/text-analytics/", "name": "Text Analytics", "abstract": "Text Analytics API documentation\nThe Text Analytics API is a cloud-based service that provides advanced natural language processing over raw text, and includes four main functions: sentiment analysis, key phrase extraction, named entity recognition, and language detection."}, {"category": ["AI + Machine Learning"], "docs_url": "https://docs.microsoft.com/en-us/azure/cognitive-services/translator/", "name": "Translator Text", "abstract": "Translator Text documentation\nTranslator Text is a cloud-based machine translation service you can use to translate text in near real-time through a simple REST API call. The API uses modern neural machine translation technology and offers statistical machine translation technology. Custom Translator is an extension of the Translator Text API, which allows you to build neural translation systems. The customized translation system can be used to translate text with the Translator Text API or Microsoft Speech Services."}, {"category": ["AI + Machine Learning", "Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/video-indexer/", "name": "Video Indexer", "abstract": "Learn about the Azure Media Services Video Indexer\nAzure Media Services Video Indexer is a cloud application built on Azure Media Analytics, Azure Cognitive Search, Cognitive Services (such as the Face API, Microsoft Translator, the Computer Vision API, and Custom Speech Service). It enables you to extract the insights from your videos using Video Indexer video and audio models."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/analysis-services/", "name": "Azure Analysis Services", "abstract": "Azure Analysis Services documentation\nLearn how to set up data modeling with Analysis Services in the cloud. Documentation shows you how to create an enterprise BI solution by using tabular data models."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure//en-us/azure/data-explorer", "name": "Azure Data Explorer", "abstract": "Hmm, we couldn't find this link, but here are some related  search results that may be helpful."}, {"category": ["Analytics", "Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/blobs/data-lake-storage-introduction", "name": "Azure Data Lake Storage", "abstract": "‎Azure Data Lake Storage Gen2 is a set of capabilities dedicated to big data analytics, built on Azure Blob\nstorage. Data Lake Storage Gen2 is the result of converging the capabilities of our two existing storage services, Azure Blob storage and Azure Data Lake Storage Gen1. Features from Azure Data Lake Storage Gen1, such as file system semantics, directory, and file level security and scale are combined with low-cost, tiered storage, high availability/disaster recovery capabilities from Azure Blob storage."}, {"category": ["Analytics", "Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-share/", "name": "Azure Data Share", "abstract": "Azure Data Share documentation\nAzure Data Share is a safe and secure service for sharing data with third-party organizations."}, {"category": ["Analytics", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/stream-analytics/", "name": "Azure Stream Analytics", "abstract": "Azure Stream Analytics documentation\nAzure Stream Analytics is a fully managed, real-time analytics service designed to help you analyze and process fast moving streams of data that can be used to trigger alerts and actions. Learn how to use Azure Stream Analytics with our quickstarts, tutorials, and samples."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/synapse-analytics/sql-data-warehouse/", "name": "Azure Synapse Analytics", "abstract": "Azure Synapse Analytics\nAzure Synapse is a limitless analytics service that brings together enterprise data warehousing and Big Data analytics. It gives you the freedom to query data on your terms, using either serverless on-demand or provisioned resources—at scale."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-catalog/", "name": "Data Catalog", "abstract": "Azure Data Catalog documentation\nLearn how to set up a data catalog so your organization can find, understand, and consume data sources. Tutorials, REST API reference, and other documentation show you how to plan and set up your data repository where data consumers can discover available data sources and gain knowledge contributed by subject matter experts."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-factory/", "name": "Data Factory", "abstract": "Azure Data Factory documentation\nAzure Data Factory is Azure's cloud ETL service for scale-out serverless data integration and data transformation.  It offers a code-free UI for intuitive authoring and single-pane-of-glass monitoring and management. You can also lift and shift existing SSIS packages to Azure and run them with full compatibility in ADF. SSIS Integration Runtime offers a fully managed service, so you don't have to worry about infrastructure management."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/data-lake-analytics/", "name": "Data Lake Analytics", "abstract": "Azure Data Lake Analytics Documentation\nAzure Data Lake Analytics allows you to run big data analysis jobs that scale to massive data sets."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/event-hubs/", "name": "Event Hubs", "abstract": "Azure Event Hubs documentation\nLearn how to use Event Hubs to ingest millions of events per second from connected devices and applications."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/hdinsight/", "name": "HDInsight", "abstract": "Azure HDInsight documentation\nAzure HDInsight is a managed Apache Hadoop service that lets you run Apache Spark, Apache Hive, Apache Kafka, Apache HBase, and more in the cloud."}, {"category": ["Analytics", "Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-monitor/", "name": "Log Analytics", "abstract": "Azure Monitor documentation\nMonitoring Azure and on-premises services. Aggregate and analyze metrics, logs, and traces. Fire alerts and send notifications or call automated solutions."}, {"category": ["Analytics"], "docs_url": "https://docs.microsoft.com/en-us/azure/hdinsight/r-server/r-server-overview", "name": "R Server for HDInsight", "abstract": "Microsoft Machine Learning Server is available as a deployment option when you create HDInsight clusters in Azure. The cluster type that provides this option is called ML Services. This capability provides on-demand access to adaptable, distributed methods of analytics on HDInsight."}, {"category": ["Blockchain"], "docs_url": "https://docs.microsoft.com/en-us/azure/blockchain/service/", "name": "Azure Blockchain Service (Preview)", "abstract": "Azure Blockchain Service documentation\nLearn how to create blockchain applications. Tutorials, API references, and other documentation show you how to use Azure Blockchain Service to create, develop, and manage blockchain applications on Azure."}, {"category": ["Blockchain"], "docs_url": "https://docs.microsoft.com/en-us/azure/blockchain/tokens/", "name": "Azure Blockchain Tokens (Preview)", "abstract": "Azure Blockchain Tokens documentation\nLearn how to create, issue, and manage blockchain tokens."}, {"category": ["Blockchain"], "docs_url": "https://docs.microsoft.com/en-us/azure/blockchain/workbench/", "name": "Azure Blockchain Workbench (Preview)", "abstract": "Azure Blockchain Workbench Preview documentation\nLearn how to create blockchain applications. Tutorials, API references, and other documentation show you how to deploy Azure Blockchain Workbench and create and manage blockchain applications on Azure."}, {"category": ["Blockchain", "Databases", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/cosmos-db/", "name": "Azure Cosmos DB", "abstract": "Azure Cosmos DB documentation\nAzure Cosmos DB is Microsoft’s globally distributed, multi-model database service for operational and analytics workloads. It offers multi-mastering feature by automatically scaling throughput, compute, and storage."}, {"category": ["Blockchain", "Integration", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/logic-apps/", "name": "Logic Apps", "abstract": "Azure Logic Apps documentation\nBuild automated scalable workflows, business processes, and enterprise orchestrations to integrate your apps and data across cloud services and on-premises systems."}, {"category": ["Compute", "Containers", "Mobile", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service/", "name": "API Apps", "abstract": "App Service documentation\nAzure App Service enables you to build and host web apps, mobile back ends, and RESTful APIs in the programming language of your choice without managing infrastructure. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. Learn how to use Azure App Service with our quickstarts, tutorials, and samples."}, {"category": ["Compute", "Mobile", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service/", "name": "App Service", "abstract": "App Service documentation\nAzure App Service enables you to build and host web apps, mobile back ends, and RESTful APIs in the programming language of your choice without managing infrastructure. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. Learn how to use Azure App Service with our quickstarts, tutorials, and samples."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/dedicated-hosts", "name": "Azure Dedicated Host", "abstract": "Azure Dedicated Host is a service that provides physical servers - able to host one or more virtual machines - dedicated to one Azure subscription. Dedicated hosts are the same physical servers used in our data centers, provided as a resource. You can provision dedicated hosts within a region, availability zone, and fault domain. Then, you can place VMs directly into your provisioned hosts, in whatever configuration best meets your needs."}, {"category": ["Compute", "Containers", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-functions/", "name": "Azure Functions", "abstract": "Azure Functions documentation\nAzure Functions is a serverless compute service that lets you run event-triggered code without having to explicitly provision or manage infrastructure."}, {"category": ["Compute", "Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/aks/", "name": "Azure Kubernetes Service (AKS)", "abstract": "Azure Kubernetes Service (AKS)\nAKS allows you to quickly deploy a production ready Kubernetes cluster in Azure. Learn how to use AKS with these quickstarts, tutorials, and samples."}, {"category": ["Compute", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/spring-cloud/", "name": "Azure Spring Cloud", "abstract": "Azure Spring Cloud documentation\nAzure Spring Cloud provides a managed service that enables Java developers to easily build and run Spring-boot based microservices on Azure with no code changes."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-vmware/", "name": "Azure VMware Solution", "abstract": "Azure VMware Solution (AVS) documentation\nLearn how to use Azure VMware Solution (AVS) to deploy a VMware private cloud to Azure"}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/batch/", "name": "Batch", "abstract": "Azure Batch documentation\nAzure Batch runs large-scale applications efficiently in the cloud. Schedule compute-intensive tasks and dynamically adjust resources for your solution without managing infrastructure."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/cloud-services/", "name": "Cloud Services", "abstract": "Azure Cloud Services documentation\nLearn how to use Cloud Services to host and run highly available, scalable cloud applications and APIs. Shows how to manage virtual machine hosts and configure, patch, and install software."}, {"category": ["Compute", "Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/container-instances/", "name": "Container Instances", "abstract": "Azure Container Instances documentation\nRun Docker containers on-demand in a managed, serverless Azure environment. Azure Container Instances is a solution for any scenario that can operate in isolated containers, without orchestration. Run event-driven applications, quickly deploy from your container development pipelines, and run data processing and build jobs."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/linux/", "name": "Linux Virtual Machines", "abstract": "Linux virtual machines in Azure\nDocumentation for creating and managing Linux virtual machines in Azure."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/workloads/sap/hana-overview-architecture", "name": "SAP HANA on Azure Large Instances", "abstract": "SAP HANA on Azure (Large Instances) is a unique solution to Azure. In addition to providing virtual machines for deploying and running SAP HANA, Azure offers you the possibility to run and deploy SAP HANA on bare-metal servers that are dedicated to you. The SAP HANA on Azure (Large Instances) solution builds on non-shared host/server bare-metal hardware that is assigned to you. The server hardware is embedded in larger stamps that contain compute/server, networking, and storage infrastructure. As a combination, it's HANA tailored data center integration (TDI) certified. SAP HANA on Azure (Large Instances) offers different server SKUs or sizes. Units can have 36 Intel CPU cores and 768 GB of memory and go up to units that have up to 480 Intel CPU cores and up to 24 TB of memory."}, {"category": ["Compute", "Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/service-fabric/", "name": "Service Fabric", "abstract": "Azure Service Fabric documentation\nAzure Service Fabric is a distributed systems platform that makes it easy to package, deploy, and manage scalable and reliable microservices and containers."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machine-scale-sets/", "name": "Virtual Machine Scale Sets", "abstract": "Virtual Machine Scale Sets documentation\nAzure virtual machine scale sets let you create and manage a group of identical, load balanced, and autoscaling VMs."}, {"category": ["Compute", "Containers", "Mobile", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service/", "name": "Web Apps", "abstract": "App Service documentation\nAzure App Service enables you to build and host web apps, mobile back ends, and RESTful APIs in the programming language of your choice without managing infrastructure. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. Learn how to use Azure App Service with our quickstarts, tutorials, and samples."}, {"category": ["Compute", "Windows Virtual Desktop"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-desktop/", "name": "Windows Virtual Desktop", "abstract": "Windows Virtual Desktop documentation\nDeliver a virtual desktop experience and remote apps to any device. Bring together Microsoft 365 and Azure to provide users with the only multi-session Windows 10 experience—with exceptional scale and reduced IT costs."}, {"category": ["Compute"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/", "name": "Windows Virtual Machines", "abstract": "Windows virtual machines in Azure\nDocumentation for creating and managing Windows virtual machines in Azure."}, {"category": ["Containers", "Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/dev-spaces/", "name": "Azure Dev Spaces", "abstract": "Azure Dev Spaces documentation\nAzure Dev Spaces is an extension to AKS that allows you to easily run and debug your code in the context of a larger application. You can test your code end-to-end, hit breakpoints on code running in the cluster, and share a development cluster between team members without interference."}, {"category": ["Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/linux/openshift-get-started", "name": "Azure Red Hat OpenShift", "abstract": "OpenShift is an open and extensible container application platform that brings Docker and Kubernetes to the enterprise."}, {"category": ["Containers"], "docs_url": "https://docs.microsoft.com/en-us/azure/container-registry/", "name": "Container Registry", "abstract": "Azure Container Registry documentation\nAzure Container Registry allows you to build, store, and manage container images and artifacts in a private registry for all types of container deployments. Use Azure container registries with your existing container development and deployment pipelines. Use Azure Container Registry Tasks to build container images in Azure on-demand, or automate builds triggered by source code updates, updates to a container's base image, or timers."}, {"category": ["Containers", "Mobile", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/app-service/containers/", "name": "Web App for Containers", "abstract": "App Service on Linux documentation\nAzure App Service enables you to build and host web apps, mobile back ends, and RESTful APIs in the programming language of your choice without managing infrastructure. It offers auto-scaling and high availability, supports both Windows and Linux, and enables automated deployments from GitHub, Azure DevOps, or any Git repo. Learn how to use Azure App Service with our quickstarts, tutorials, and samples."}, {"category": ["Databases", "Integration"], "docs_url": "https://docs.microsoft.com/en-us/azure/healthcare-apis/", "name": "Azure API for FHIR", "abstract": "Azure API for FHIR Documentation\nAzure API for FHIR is a managed, standards-based, compliant API for clinical health data that enables solutions for actionable analytics and machine learning."}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-cache-for-redis/", "name": "Azure Cache for Redis", "abstract": "Azure Cache for Redis Documentation\nLearn how to use Azure Cache for Redis, a secure data cache and messaging broker that provides high throughput and low-latency access to data for applications. Tutorials, API references, and other documentation show you how to use Azure Cache for Redis from any application on Azure."}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/mariadb/", "name": "Azure Database for MariaDB", "abstract": "Azure Database for MariaDB documentation\nAzure Database for MariaDB is a relational database service based on the open-source MariaDB Server engine.  It's a fully managed database as a service offering that can handle mission-critical workloads with predictable performance and dynamic scalability. Develop applications with Azure Database for MariaDB leveraging the open-source tools and platform of your choice. Learn how to use Azure Database for MariaDB with our quickstarts, tutorials, and samples."}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/mysql/", "name": "Azure Database for MySQL", "abstract": "Azure Database for MySQL documentation\nAzure Database for MySQL is a relational database service powered by the MySQL community edition.  It's a fully managed database as a service offering that can handle mission-critical workloads with predictable performance and dynamic scalability. Develop applications with Azure Database for MySQL leveraging the open-source tools and platform of your choice. Learn how to use Azure Database for MySQL with our quickstarts, tutorials, and samples."}, {"category": ["Databases", "Hybrid"], "docs_url": "https://docs.microsoft.com/en-us/azure/postgresql/", "name": "Azure Database for PostgreSQL", "abstract": "Azure Database for PostgreSQL documentation\nAzure Database for PostgreSQL is a relational database service based on the open-source Postgres database engine. It's a fully managed database-as-a-service offering that can handle mission-critical workloads with predictable performance, security, high availability, and dynamic scalability. It's available in two deployment options, as a single server and as a Hyperscale (Citus) cluster. The Hyperscale (Citus) option horizontally scales queries across multiple machines using sharding, and serves applications that require greater scale and performance. Learn how to use Azure Database for PostgreSQL with our quickstarts, tutorials, and samples."}, {"category": ["Databases", "Migration"], "docs_url": "https://docs.microsoft.com/en-us/azure/dms/", "name": "Azure Database Migration Service", "abstract": "Azure Database Migration Service documentation\nAzure Database Migration Service enables seamless migrations from multiple database sources to Azure Data platforms with minimal downtime. The service uses the Data Migration Assistant to generate assessment reports that provide recommendations to guide you through the changes required before performing a migration. When you're ready to begin the migration process, Azure Database Migration Service performs all the required steps."}, {"category": ["Databases", "Hybrid"], "docs_url": "https://docs.microsoft.com/en-us/azure/sql-database/", "name": "Azure SQL Database", "abstract": "Azure SQL Database documentation\nAzure SQL Database is a relational database-as-a-service (DBaaS) based on the latest stable version of Microsoft SQL Server."}, {"category": ["Databases", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/sql-database-edge/", "name": "Azure SQL Database Edge (Preview)", "abstract": "Azure SQL Database Edge documentation\nAzure SQL Database Edge is an optimized relational database engine geared for IoT and edge deployments."}, {"category": ["Databases"], "docs_url": "https://docs.microsoft.com/en-us/azure/cosmos-db/table-storage-overview", "name": "Table Storage", "abstract": "Tip"}, {"category": ["Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-app-configuration/", "name": "App Configuration", "abstract": "Azure App Configuration documentation\nLearn how to use Azure App Configuration, a managed service that helps developers centralize their application and feature settings simply and securely."}, {"category": ["Developer Tools", "DevOps"], "docs_url": "https://docs.microsoft.com/en-us/azure/lab-services/", "name": "Azure DevTest Labs", "abstract": "Azure DevTest Labs documentation\nLearn how to use Azure DevTest Labs to quickly set up a development, test, hackathon, or a classroom lab for your team or students in the cloud."}, {"category": ["Developer Tools"], "docs_url": "https://docs.microsoft.com/en-us/azure/lab-services/", "name": "Azure Lab Services", "abstract": "Azure DevTest Labs documentation\nLearn how to use Azure DevTest Labs to quickly set up a development, test, hackathon, or a classroom lab for your team or students in the cloud."}, {"category": ["DevOps", "Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-monitor/", "name": "Application Insights", "abstract": "Azure Monitor documentation\nMonitoring Azure and on-premises services. Aggregate and analyze metrics, logs, and traces. Fire alerts and send notifications or call automated solutions."}, {"category": ["DevOps", "Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-monitor/", "name": "Azure Monitor", "abstract": "Azure Monitor documentation\nMonitoring Azure and on-premises services. Aggregate and analyze metrics, logs, and traces. Fire alerts and send notifications or call automated solutions."}, {"category": ["Hybrid", "Identity", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/active-directory/", "name": "Azure Active Directory (AD)", "abstract": "Azure Active Directory (Azure AD) is a multi-tenant, cloud-based identity and access management service."}, {"category": ["Hybrid"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-arc/", "name": "Azure Arc (Preview)", "abstract": "Azure Arc\nAzure Arc extends Azure Resource Manager capabilities to Linux and Windows servers, as well as Kubernetes clusters on any infrastructure across on-premises, multi-cloud, and edge. With Azure Arc, customers can also run Azure data services anywhere, realizing the benefits of cloud innovation, including always up-to-date data capabilities, deployment in seconds (rather than hours), and dynamic scalability on any infrastructure. Azure Arc for servers is currently in public preview."}, {"category": ["Hybrid", "Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/expressroute/", "name": "Azure ExpressRoute", "abstract": "ExpressRoute documentation\nLearn how to use ExpressRoute to set up a fast, private connection to Microsoft cloud services from your on-premises infrastructure or colocation facility."}, {"category": ["Hybrid", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-edge/", "name": "Azure IoT Edge", "abstract": "Azure IoT Edge documentation\nAzure IoT Edge extends IoT Hub. Analyze device data locally instead of in the cloud to send less data to the cloud, react to events quickly, and operate offline."}, {"category": ["Hybrid", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/sentinel/", "name": "Azure Sentinel", "abstract": "Azure Sentinel documentation\nThis article presents use cases to get started using Azure Sentinel. See and stop threats before they cause harm, with SIEM reinvented for a modern world. Azure Sentinel is your birds-eye view across the enterprise."}, {"category": ["Hybrid", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/security-center/", "name": "Security Center", "abstract": "Azure Security Center documentation\nAzure Security Center provides unified security management and advanced threat protection across hybrid cloud workloads."}, {"category": ["Identity"], "docs_url": "https://docs.microsoft.com/en-us/azure/active-directory-b2c/", "name": "Azure Active Directory B2C", "abstract": "Azure Active Directory B2C documentation\nAzure Active Directory B2C (Azure AD B2C) is an identity management service that enables custom control of how your customers sign up, sign in, and manage their profiles when using your iOS, Android, .NET, single-page (SPA), and other applications. Learn how to use Azure AD B2C with our quickstarts, tutorials, and samples."}, {"category": ["Identity", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/active-directory-domain-services/", "name": "Azure Active Directory Domain Services", "abstract": "Azure AD Domain Services documentation\nLearn how to use Azure Active Directory Domain Services to provide Kerberos or NTLM authentication to applications or join Azure VMs to a managed domain."}, {"category": ["Integration", "Internet of Things", "Mobile", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/api-management/", "name": "API Management", "abstract": "API Management documentation\nLearn how to use API Management to publish APIs to external, partner, and employee developers securely and at scale. Shows you how to create and manage modern API gateways for existing back-end services hosted anywhere."}, {"category": ["Integration", "Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/event-grid/", "name": "Event Grid", "abstract": "Azure Event Grid documentation\nLearn how to use Azure Event Grid to react to relevant events across both Azure and non-Azure services in near-real time fashion."}, {"category": ["Integration"], "docs_url": "https://docs.microsoft.com/en-us/azure/service-bus-messaging/", "name": "Service Bus", "abstract": "Azure Service Bus Messaging documentation\nLearn how to set up messaging that connects applications and services across on-premises and cloud environments."}, {"category": ["Internet of Things", "Mixed Reality"], "docs_url": "https://docs.microsoft.com/en-us/azure/digital-twins/", "name": "Azure Digital Twins (Preview)", "abstract": "Azure Digital Twins Preview Documentation\nLearn how to use Azure Digital Twins to connect people, places, and things, and to build IoT solutions with spatial intelligence. Walk through the Quickstart and Tutorials to monitor an imaginary smart building, learn in-depth concepts, and create a next generation IoT solution that models your physical environment."}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-central/", "name": "Azure IoT Central", "abstract": "Explore the Azure IoT Central service and solutions documentation."}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-hub/", "name": "Azure IoT Hub", "abstract": "Description not found"}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/iot-accelerators/", "name": "Azure IoT solution accelerators", "abstract": "Azure IoT solution accelerators documentation\nAzure IoT solution accelerators are complete, ready-to-deploy IoT solutions that implement common IoT scenarios such as remote monitoring."}, {"category": ["Internet of Things", "Mobile", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-maps/", "name": "Azure Maps", "abstract": "Azure Maps Documentation\nMicrosoft Azure Maps provides developers from all industries with powerful geospatial capabilities. Those geospatial capabilities are packed with the freshest mapping data. Azure Maps is available for both web and mobile applications. Azure Maps is an Azure One API compliant set of REST APIs. The following are only a high-level overview of the services which Azure Maps offers - Maps, Search, Routing, Traffic, Mobility, Weather, Time Zones, Geolocation, Geofencing, Map Data, and Spatial Operations. The Web and Android SDKs make development easy, flexible, and portable across multiple platforms."}, {"category": ["Internet of Things"], "docs_url": "https://docs.microsoft.com/en-us/azure/time-series-insights/", "name": "Azure Time Series Insights", "abstract": "Azure Time Series Insights Documentation\nLearn how to run Azure IoT analytics in the cloud with fully managed event processing using quickstarts, tutorials, JavaScript samples, and REST API documentation. Analyze data from applications, sensors, devices, and more in real time."}, {"category": ["Internet of Things", "Mobile", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/notification-hubs/", "name": "Notification Hubs", "abstract": "Azure Notification Hubs documentation\nSend push notifications from any backend to any mobile device. Tutorials, API references, and other documentation."}, {"category": ["Internet of Things", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/asc-for-iot/", "name": "Security Center for IoT", "abstract": "Azure Security Center for IoT documentation\nAzure Security Center for IoT is an Azure based cloud security service providing comprehensive IoT device threat protection."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/automation/", "name": "Automation", "abstract": "Description not found"}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/advisor/", "name": "Azure Advisor", "abstract": "Azure Advisor documentation\nAzure Advisor scans your Azure configuration and recommends changes to optimize deployments, increase security, and save you money."}, {"category": ["Management and Governance", "Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/backup/", "name": "Azure Backup", "abstract": "Azure Backup service documentation\nThe Azure Backup service provides simple, secure, and cost-effective solutions to back up your data and recover it from the Microsoft Azure cloud."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/governance/blueprints/", "name": "Azure Blueprints (Preview)", "abstract": "Azure Blueprints documentation\nSimplify deployments by packaging artifacts, such as Resource Manager templates, role-based access controls, and policies, in a single blueprint definition."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/cloud-shell/overview", "name": "Azure Cloud Shell", "abstract": "Azure Cloud Shell is an interactive, authenticated, browser-accessible shell for managing Azure resources.\nIt provides the flexibility of choosing the shell experience that best suits the way you work, either Bash or PowerShell."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/lighthouse/", "name": "Azure Lighthouse", "abstract": "Azure Lighthouse documentation\nAzure Lighthouse lets service providers manage Azure resources across all their customers with higher automation, scalability, and enhanced governance."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-resource-manager/managed-applications/", "name": "Azure Managed Applications", "abstract": "Managed Applications documentation\nOffer cloud solutions that are easy for consumers to deploy and operate."}, {"category": ["Management and Governance", "Migration"], "docs_url": "https://docs.microsoft.com/en-us/azure/migrate/", "name": "Azure Migrate", "abstract": "Azure Migrate documentation\nAzure Migrate provides a central hub of tools for discovery, assessment, and migration of on-premises workloads to Azure."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/governance/policy/", "name": "Azure Policy", "abstract": "Azure Policy documentation\nAzure Policy helps you manage and prevent IT issues with policy definitions that enforce rules and effects for your resources."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-resource-manager/", "name": "Azure Resource Manager", "abstract": "Azure Resource Manager is the deployment and management service for Azure. Use infrastructure as code to reliably deploy and manage your Azure solutions."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-resource-manager/templates/", "name": "Azure Resource Manager templates", "abstract": "ARM template documentation\nAzure Resource Manager templates are a JavaScript Object Notation (JSON) files that define the infrastructure and configuration for your project."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/service-health/", "name": "Azure Service Health", "abstract": "Azure Service Health documentation\nAzure Service Health is a suite of experiences that provide personalized guidance and support when issues in Azure services are or may affect you in the future. Azure Service Health is composed of Azure status, the service health service, and Resource Health."}, {"category": ["Management and Governance", "Migration"], "docs_url": "https://docs.microsoft.com/en-us/azure/site-recovery/", "name": "Azure Site Recovery", "abstract": "Azure Site Recovery documentation\nUse Azure Site Recovery for disaster recovery of on-premises workloads, and Azure VMs."}, {"category": ["Management and Governance", "Migration"], "docs_url": "https://docs.microsoft.com/en-us/azure/cost-management-billing/", "name": "Cost Management + Billing", "abstract": "Azure Cost Management and Billing help you understand Azure billing, manage your account and subscriptions, monitor and control Azure spending and optimize resource use. Learn how to analyze costs, create and manage budgets, export data, and review and act on recommendations."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-portal/", "name": "Microsoft Azure portal", "abstract": "Azure portal documentation\nThe Azure portal is a web-based, unified console that provides an alternative to command-line tools. You can manage your Azure subscription with the Azure portal. Build, manage, and monitor everything from simple web apps to complex cloud deployments. Create custom dashboards for an organized view of resources and configure accessibility options for the best experience."}, {"category": ["Management and Governance", "Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/network-watcher/", "name": "Network Watcher", "abstract": "Azure Network Watcher documentation\nLearn how to use Azure Network Watcher. Quickstarts, tutorials, and more, show you how to gain insight into your Azure Virtual Network with tools like packet capture and NSG flows logs, to diagnose problems with traffic filtering and routing, and to monitor connections."}, {"category": ["Management and Governance"], "docs_url": "https://docs.microsoft.com/en-us/azure/scheduler/", "name": "Scheduler", "abstract": "Azure Scheduler documentation\nAzure Logic Apps is replacing Azure Scheduler, which is being retired. To continue working with the jobs that you set up in Scheduler, please migrate to Azure Logic Apps as soon as possible."}, {"category": ["Management and Governance", "Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/traffic-manager/", "name": "Traffic Manager", "abstract": "Traffic Manager documentation\nLearn how to use Azure Traffic Manager. Quickstarts, tutorials, samples, and more, show you how to manage incoming traffic for optimal application performance, and how to distribute traffic to Azure or external service endpoints."}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/latest/use-azure-media-player", "name": "Azure Media Player", "abstract": "Azure Media Player is a web video player built to play back media content from Microsoft Azure Media Services on a wide variety of browsers and devices. Azure Media Player utilizes industry standards, such as HTML5, Media Source Extensions (MSE), and Encrypted Media Extensions (EME) to provide an enriched adaptive streaming experience. When these standards are not available on a device or in a browser, Azure Media Player uses Flash and Silverlight as fallback technology. Regardless of the playback technology used, developers will have a unified JavaScript interface to access APIs. This allows for content served by Azure Media Services to be played across a wide-range of devices and browsers without any extra effort."}, {"category": ["Media", "Networking", "Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/cdn/", "name": "Content Delivery Network", "abstract": "Azure CDN Documentation\nAzure Content Delivery Network (CDN) is a global CDN solution for delivering high-bandwidth content. It can be hosted in Azure or any other location. With Azure CDN, you can cache static objects loaded from Azure Blob storage, a web application, or any publicly accessible web server, by using the closest point of presence (POP) server. Azure CDN can also accelerate dynamic content, which cannot be cached, by leveraging various network and routing optimizations."}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/latest/content-protection-overview", "name": "Content Protection", "abstract": "Use Azure Media Services to help secure your media from the time it leaves your computer all the way through storage, processing, and delivery. With Media Services, you can deliver your live and on-demand content encrypted dynamically with Advanced Encryption Standard (AES-128) or any of the three major digital rights management (DRM) systems: Microsoft PlayReady, Google Widevine, and Apple FairPlay. Media Services also provides a service for delivering AES keys and DRM (PlayReady, Widevine, and FairPlay) licenses to authorized clients. If content is encrypted with an AES clear key and is sent over HTTPS, it is not in clear until it reaches the client."}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/latest/encoding-concept", "name": "Encoding", "abstract": "The term encoding in Media Services applies to the process of converting files containing digital video and/or audio from one standard format to another, with the purpose of (a) reducing the size of the files, and/or (b) producing a format that's compatible with a broad range of devices and apps. This process is also referred to as video compression, or transcoding. See the Data compression and the What Is Encoding and Transcoding? for further discussion of the concepts."}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/latest/stream-live-tutorial-with-api", "name": "Live and On-Demand Streaming", "abstract": "Note"}, {"category": ["Media"], "docs_url": "https://docs.microsoft.com/en-us/azure/media-services/latest/", "name": "Media Services", "abstract": "Azure Media Services v3 cloud-based platform documentation\nLearn how to encode and package content, stream videos on-demand, broadcast live, analyze your videos with Media Services v3. Tutorials, API references, and other documentation show you how to securely deliver on-demand and live video or audio streams that scale to millions of users."}, {"category": ["Migration", "Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/databox-family/", "name": "Data Box", "abstract": "The Azure Data Box family offers products of differing storage capacities to help send terabytes (TB) of data to Azure in a quick, inexpensive, and reliable way. Microsoft accelerates secure data transfer by shipping you proprietary storage devices that enable offline or over the network data transfer."}, {"category": ["Mixed Reality"], "docs_url": "https://docs.microsoft.com/en-us/azure/remote-rendering/", "name": "Remote Rendering (Preview)", "abstract": "Azure Remote Rendering documentation\nAzure Remote Rendering (ARR) is a service that enables you to render highly complex 3D models in real time on devices such as HoloLens 2. ARR is currently in public preview."}, {"category": ["Mixed Reality"], "docs_url": "https://docs.microsoft.com/en-us/azure/spatial-anchors/", "name": "Spatial Anchors (Preview)", "abstract": "Azure Spatial Anchors documentation\nSpatial Anchors is a cross-platform developer service that allows you to create mixed reality experiences using objects that persist their location across devices over time."}, {"category": ["Networking", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/application-gateway/", "name": "Application Gateway", "abstract": "Azure Application Gateway documentation\nLearn how to create application gateways. This documentation helps you plan, deploy, and manage web traffic to your Azure resources."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/bastion/", "name": "Azure Bastion", "abstract": "Azure Bastion documentation\nLearn how to use Azure Bastion to connect to a virtual machine. Configure secure and seamless RDP/SSH connectivity to your virtual machines directly in the Azure portal over SSL. When you connect via Azure Bastion, your virtual machines do not need a public IP address."}, {"category": ["Networking", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-network/ddos-protection-overview", "name": "Azure DDoS Protection", "abstract": "Distributed denial of service (DDoS) attacks are some of the largest availability and security concerns facing customers that are moving their applications to the cloud. A DDoS attack attempts to exhaust an application's resources, making the application unavailable to legitimate users. DDoS attacks can be targeted at any endpoint that is publicly reachable through the internet."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/dns/", "name": "Azure DNS", "abstract": "Azure DNS documentation\nLearn how to use Azure DNS. Quickstarts, tutorials, samples, and more, show you how to set up and manage DNS zones and records for domain names."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/firewall/", "name": "Azure Firewall", "abstract": "Azure Firewall documentation\nLearn how to deploy Azure Firewall, a cloud-based network security service."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/firewall-manager/", "name": "Azure Firewall Manager (Preview)", "abstract": "Azure Firewall Manager documentation\nLearn how to deploy Azure Firewall Manager, a globally distributed security management service."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/frontdoor/", "name": "Azure Front Door", "abstract": "Azure Front Door documentation\nAzure Front Door is a scalable and secure entry point for fast delivery of your global web applications."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/internet-analyzer/", "name": "Azure Internet Analyzer (Preview)", "abstract": "Azure Internet Analyzer documentation (Preview)\nInternet Analyzer is a client-side measurement platform that enables you to test how networking infrastructure changes will impact your customers’ performance. Whether you’re migrating from on-premises to Azure or evaluating a new Azure service, Internet Analyzer allows you to learn from your users’ data and Microsoft’s rich analytics to better understand and optimize your network architecture with Azure—before you migrate."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/private-link/", "name": "Azure Private Link", "abstract": "Private Link documentation\nAzure Private Link enables you to access Azure PaaS Services (for example, Azure Storage and SQL Database) and Azure hosted customer-owned/partner services over a Private Endpoint in your virtual network.  Traffic between your virtual network and the service traverses over the Microsoft backbone network, eliminating exposure from the public Internet. You can also create your own Private Link Service in your virtual network and deliver it privately to your customers."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/load-balancer/", "name": "Load Balancer", "abstract": "Load Balancer documentation\nLearn how to use Azure Load Balancer. Quickstarts, tutorials, samples, and more, show you how to deploy a load balancer and load balance traffic to and from virtual machines and cloud resources, and in cross-premises virtual networks."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-network/", "name": "Virtual Network", "abstract": "Virtual Network documentation\nLearn how to use Azure Virtual Network. Quickstarts, tutorials, samples, and more, show you how to deploy a virtual network, control traffic filtering and routing, and connect a virtual network to other virtual networks."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-wan/", "name": "Virtual WAN", "abstract": "Virtual WAN documentation\nLearn how to configure, create, and manage an Azure Virtual WAN. Build secure global scale branch connectivity."}, {"category": ["Networking", "Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/vpn-gateway/", "name": "VPN Gateway", "abstract": "VPN Gateway documentation\nLearn how to configure, create, and manage an Azure VPN gateway. Create encrypted cross-premises connections to your virtual network from on-premises locations, or create encrypted connections between VNets."}, {"category": ["Networking"], "docs_url": "https://docs.microsoft.com/en-us/azure/web-application-firewall/", "name": "Web Application Firewall", "abstract": "Web Application Firewall documentation\nWeb Application Firewall (WAF) provides centralized protection of your web applications from common exploits and vulnerabilities. You can deploy WAF on Azure Application Gateway or WAF on Azure Front Door Service."}, {"category": ["Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/dedicated-hsm/", "name": "Azure Dedicated HSM", "abstract": "Azure Dedicated HSM documentation\nLearn how to use Azure Dedicated HSM to create and maintain keys that access and encrypt your cloud resources, apps, and solutions. Tutorials, API references, and more."}, {"category": ["Security"], "docs_url": "https://docs.microsoft.com/en-us/azure/key-vault/", "name": "Key Vault", "abstract": "Learn how to use Key Vault to create and maintain keys that access and encrypt your cloud resources, apps, and solutions. Tutorials, API references, and more."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/blobs/storage-blob-storage-tiers", "name": "Archive Storage", "abstract": "Azure storage offers different access tiers, which allow you to store blob object data in the most cost-effective manner. The available access tiers include:"}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/avere-vfxt/", "name": "Avere vFXT for Azure", "abstract": "Avere vFXT for Azure documentation\nAvere vFXT for Azure provides a cloud-based cache layer for data-intensive high-performance computing (HPC) tasks."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/fxt-edge-filer/", "name": "Azure FXT Edge Filer", "abstract": "Azure FXT Edge Filer documentation\nThe Azure FXT Edge Filer hybrid storage cache is a hardware/software hybrid system that speeds up data access for file-based, read-intensive high-performance computing (HPC) workflows."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/hpc-cache/", "name": "Azure HPC Cache", "abstract": "Azure HPC Cache documentation\nUse Azure HPC Cache to expedite file access for read-intensive high-performance computing (HPC) workloads"}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-netapp-files/", "name": "Azure NetApp Files", "abstract": "Azure NetApp Files documentation\nLearn how to use Azure NetApp Files to create and manage NetApp accounts, capacity pools, and volumes, configure export policy, mount a volume for a virtual machine, and manage snapshots."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/blobs/", "name": "Blob Storage", "abstract": "Azure Blob storage documentation\nAzure Blob storage is Microsoft's object storage solution for the cloud. Blob storage is optimized for storing massive amounts of unstructured data."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/managed-disks-overview", "name": "Disk Storage", "abstract": "Azure managed disks are block-level storage volumes that are managed by Azure and used with Azure Virtual Machines. Managed disks are like a physical disk in an on-premises server but virtualized. With managed disks, all you have to do is specify the disk size, the disk type, and provision the disk. Once you provision the disk, Azure handles the rest."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/files/", "name": "File Storage", "abstract": "Azure Files documentation\nAzure Files offers fully managed cross-platform file shares in the cloud that are accessible via the Server Message Block (SMB) protocol."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/virtual-machines/windows/managed-disks-overview", "name": "Managed Disks", "abstract": "Azure managed disks are block-level storage volumes that are managed by Azure and used with Azure Virtual Machines. Managed disks are like a physical disk in an on-premises server but virtualized. With managed disks, all you have to do is specify the disk size, the disk type, and provision the disk. Once you provision the disk, Azure handles the rest."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/queues/", "name": "Queue Storage", "abstract": "Azure Queue storage documentation\nAzure Queue storage is a service for storing large numbers of messages. Access messages from anywhere in the world via HTTP or HTTPS."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storage/", "name": "Storage", "abstract": "Azure Storage includes object, file, disk, queue, and table storage. There are also services for hybrid storage solutions, and services to transfer, share, and back up data."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/vs-azure-tools-storage-manage-with-storage-explorer", "name": "Storage Explorer", "abstract": "Microsoft Azure Storage Explorer is a standalone app that makes it easy to work with Azure Storage data on Windows, macOS, and Linux. In this article, you'll learn several ways of connecting to and managing your Azure storage accounts."}, {"category": ["Storage"], "docs_url": "https://docs.microsoft.com/en-us/azure/storsimple/", "name": "StorSimple", "abstract": "StorSimple documentation\nLearn how to use Azure StorSimple, an integrated storage solution that manages storage tasks between on-premises devices and Azure cloud storage."}, {"category": ["Web"], "docs_url": "https://docs.microsoft.com/en-us/azure/azure-signalr/", "name": "Azure SignalR Service", "abstract": "Azure SignalR Service documentation\nAzure SignalR Service is an Azure managed service that helps developers easily build web applications with real-time features."}], "categories": ["AI + Machine Learning", "Analytics", "Blockchain", "Compute", "Containers", "Databases", "DevOps", "Developer Tools", "Hybrid", "Identity", "Integration", "Internet of Things", "Management and Governance", "Media", "Migration", "Mixed Reality", "Mobile", "Networking", "Security", "Storage", "Web", "Windows Virtual Desktop"]}